note/note-linux-centos.org
#+TITLE: note-linux-centos

vbox自建centos集群环境，方便本地开发测试,

* VboxManage
   
  - vms 基本信息
    
    VBoxManage showvminfo Centos701

  - 无界面启动vms

    VBoxManage startvm Centos701 --type headless

    VBoxManage controlvm ubuntu01 savestate # 保存当前状态关闭

  - 修改vms内存总量

    VBoxManage modifyvm Centos701 --memory 1024
    
  - 修改vms磁盘容量

    VBoxManage modifyhd Centos702.vdi --resize 7168

    #+BEGIN_SRC 
   
如果创建过快照，快照的磁盘空间也需要修改
VBoxManage modifyhd \{aea51811-5e79-46e9-b5ba-f66740e6f47b\}.vdi  --resize 10248
    
    #+END_SRC
    
  - 创建快照
    
    VBoxManage snapshot ubuntu01 take ubuntu_basic_ssh

    VBoxManage snapshot ubuntu01 list

    VBoxManage snapshot ubuntu01 delete ubuntu_basic

    VBoxManage snapshot ubuntu01 restore ubuntu_basic_ssh

  - clone vm

    VBoxManage clonevm  Centos701 --snapshot  centos7_basic  --name Centos_basic

#+BEGIN_SRC 

查看当前虚拟机  VBoxManage list vms  

查看当前正在运行的虚拟机  VBoxManage list runningvms  

启动虚拟机  VBoxManage startvm 虚拟机名  

无前端图形界面方式启动虚拟机  VBoxManage startvm 虚拟机名 --type headless  

#+END_SRC

* centos7 basic environment
  centos7 镜像[[http://isoredirect.centos.org/centos/7/isos/x86_64/CentOS-7-x86_64-Minimal-1708.iso][下载]]

** lvm 
   在文件中添加要挂载的分区和文件目录可以修改文件
   
   /etc/fstab

   /dev/sda5/    media/win    ntfs    defaults   02

   然后 mount -a

   1. 查看几块硬盘
   
      sudo fdisk -l |grep sd
      
   2. 创建分区
   
      虚拟机现有20g的硬盘,使用fdisk划分磁盘
       
      sudo fdisk /dev/sda
   
      #+BEGIN_VERSE
         m  帮助信息  
         n 创建分区
         e 扩展分区    +5G  pppp/pppe
         p 打印分区
         t 分区类型 L  (lvm)
         w 写入保存分区
      #+END_VERSE
      
   3. 格式化 分区

   - LVM
     pv --> vg --> lv
     参考:
     http://blog.sina.com.cn/s/blog_b77735d20101e5cn.html
     http://aurthurxlc.github.io/Aurthur-2017/Centos-7-extend-lvm-volume.html

     #+BEGIN_SRC 
     fdisk -l | grep sd
     fdisk /dev/sda
     partprobe
     pvdisplay
     pvcreate /dev/sda3
     vgdisplay
     vgextend centos /dev/sda3
     lvdisplay
     #lvcreate -L 3.31G -n manue1 centos
     #mkfs.xfs /dev/centos/manue1
     #lvremove -f /dev/centos/manue1
     lvextend -l +100%FREE /dev/centos/root
     df -Th
     xfs_growfs /dev/centos/root
     #+END_SRC
** ip
  * 联网方式: 配置三张网卡

    1. NAT 
       网卡1 用来连接外网 
    2. Host-only
       用来配置静态IP 配置集群服务的时候不需要修改IP
       vi /etc/sysconfig/network-scripts/  
       #+BEGIN_SRC 
         #static assignment
         ONBOOT=yes
         BOOTPROTO=static
         IPADDR=192.168.56.10
         NETMASK=255.255.255.0
         GATEWAY=192.168.56.1
       #+END_SRC
    3. Bridge
       vbox 自动配置IP，也很方便 
       
    这边打算使用网卡1 nat模式连接外网，网卡3的桥接模式与局域网内其他主机通信,网卡二的主机模式搭建集群

    注意： 网卡二和网卡三的 gateway 字段要注释掉
      
    sudo service network restart
    
** sshd

  ssh 连接异常慢

  sudo vi /etc/ssh/sshd_config

  : UseDNS no

** hostname

  永久修改主机名字

  sudo hostnamectl --static set-hostname master

  sudo vi /etc/hosts

  #+BEGIN_EXAMPLE
  [manue1@localhost ~]$ cat /etc/hostname
   master
  [manue1@localhost ~]$ cat /etc/hosts
   127.0.0.1 master
   ::1 master
  #+END_EXAMPLE


** yum source

  sudo yum -y install wget
  
  - 备份

    sudo mv /etc/yum.repos.d/CentOS-Base.repo /etc/yum.repos.d/CentOS-Base.repo.backup

  - 设置aliyun source

    sudo wget -O /etc/yum.repos.d/CentOS-Base.repo http://mirrors.aliyun.com/repo/Centos-7.repo

  - 设置EPLEPEL source
    
    sudo wget -P /etc/yum.repos.d/ http://mirrors.aliyun.com/repo/epel-7.repo

    添加后可以像fedora上 yum install packname

  - 清理缓存并生成新的缓存

    sudo yum clean all  

    sudo yum makecache  

** ntp

   | master  | server |  
   |---------+--------+
   | slave01 | client |  
   | slave02 | client |

  - any nodes

    sudo yum -y install ntp
    
    timedatectl set-timezone Asia/Shanghai   # 设置上海时区
   
  - server configural
     
     systemctl start ntpd
      
     systemctl enable ntpd

     vi /etc/ntp.conf 
     
     #+BEGIN_SRC 
     
restrict 192.168.56.0 mask 255.255.0.0

server 127.127.1.0

fudge 127.127.1.0 stratum 10
     #+END_SRC
     
     systemctl restart ntpd

   - client configural
     
     systemctl start ntpd
     
     systemctl enable ntpd

     vi /etc/ntp.conf
     
     #+BEGIN_SRC 
server 192.168.56.10
     
     #+END_SRC

    netstat -anp | grep 123

** firewallds
  - 查看状态 :: systemctl status firewalld
  - 关闭 :: systemctl stop firewalld
  - 禁用 :: systemctl disable firewalld
** disable selinux
   一款为了提高系统安全性的软件：对系统服务，文件权限，网络端口访问有极其严格的限制，
   例如：如果对一个文件没有正确安全上下文配置， 甚至你是root用户，你也不能启动某服务

  sudo vi /etc/sysconfig/selinux
  : selinux = disable
