note/note-linux-centos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-24 Thu 23:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>note-linux-centos</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="manue1" />
<link rel="stylesheet" type="text/css" href="https://www.manue1.site/css/style.css" />
<!-- <link rel="stylesheet" type="text/css" href="http://www.langdebuqing.com/css/style.css" /> -->
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.site">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">note-linux-centos</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org490268d">1. VboxManage</a></li>
<li><a href="#orgb393f55">2. centos7 basic environment</a>
<ul>
<li><a href="#org9478a1b">2.1. lvm</a></li>
<li><a href="#org96e4fed">2.2. ip</a></li>
<li><a href="#orga0f2035">2.3. sshd</a></li>
<li><a href="#org34481cb">2.4. hostname</a></li>
<li><a href="#org6940d1d">2.5. yum source</a></li>
<li><a href="#org9a88a7c">2.6. ntp</a></li>
<li><a href="#org421fd17">2.7. firewallds</a></li>
<li><a href="#orge8fb225">2.8. disable selinux</a></li>
<li><a href="#org4b7d787">2.9. java  &amp; scala</a></li>
</ul>
</li>
<li><a href="#orgd7d61fe">3. hadoop 集群配置</a>
<ul>
<li><a href="#org111cbbf">3.1. hadoop hbase spark 版本选择</a></li>
<li><a href="#org8564b3a">3.2. 环境准备</a></li>
<li><a href="#orga2c20cb">3.3. 配置hadoop cluster</a></li>
<li><a href="#org36ba49a">3.4. 启动hadoop</a></li>
</ul>
</li>
<li><a href="#org5534892">4. elasticstk 集群</a>
<ul>
<li><a href="#org2df9990">4.1. elasticsearch-611</a></li>
<li><a href="#orgadc077b">4.2. kibana</a></li>
<li><a href="#org076e19f">4.3. logstash</a></li>
<li><a href="#orgd29a6c6">4.4. beats</a>
<ul>
<li><a href="#orgbc6f0c3">4.4.1. topbeat</a></li>
<li><a href="#orgf6de2b3">4.4.2. filebeat</a></li>
<li><a href="#org5449b9f">4.4.3. metricbeat</a></li>
<li><a href="#org2a15685">4.4.4. packetbeat</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1d8d55d">5. hive</a>
<ul>
<li><a href="#orga0a9e33">5.1. install mariadb</a></li>
<li><a href="#org81c53db">5.2. config hive</a></li>
<li><a href="#orgd8a5063">5.3. start hive</a></li>
</ul>
</li>
<li><a href="#orgefc5e17">6. sqoop</a></li>
<li><a href="#org92e5865">7. zookeeper</a>
<ul>
<li><a href="#orgdffecae">7.1. Replicated ZooKeeper configural</a></li>
</ul>
</li>
<li><a href="#org67b0d04">8. hbase</a>
<ul>
<li><a href="#org80aab88">8.1. hbase configural</a></li>
<li><a href="#org6af7569">8.2. hbase start</a></li>
</ul>
</li>
<li><a href="#org3406069">9. kafka</a>
<ul>
<li><a href="#orgb7be641">9.1. kafka configural</a></li>
<li><a href="#orga80f540">9.2. kafka start service</a></li>
<li><a href="#orgfafc201">9.3. use kafka</a></li>
</ul>
</li>
<li><a href="#org0076e18">10. spark</a>
<ul>
<li><a href="#org4fd5fec">10.1. spark configural</a></li>
<li><a href="#orgf5bd40a">10.2. spark start</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
vbox自建centos集群环境，方便本地开发测试,
</p>

<div id="outline-container-org490268d" class="outline-2">
<h2 id="org490268d"><span class="section-number-2">1</span> VboxManage</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><p>
vms 基本信息
</p>

<p>
VBoxManage showvminfo Centos701
</p></li>

<li><p>
无界面启动vms
</p>

<p>
VBoxManage startvm Centos701 &#x2013;type headless
</p>

<p>
VBoxManage controlvm ubuntu01 savestate # 保存当前状态关闭
</p></li>

<li><p>
修改vms内存总量
</p>

<p>
VBoxManage modifyvm Centos701 &#x2013;memory 1024
</p></li>

<li><p>
修改vms磁盘容量
</p>

<p>
VBoxManage modifyhd Centos702.vdi &#x2013;resize 7168
</p>

<pre class="example">

如果创建过快照，快照的磁盘空间也需要修改
VBoxManage modifyhd \{aea51811-5e79-46e9-b5ba-f66740e6f47b\}.vdi  --resize 10248

</pre></li>

<li><p>
创建快照
</p>

<p>
VBoxManage snapshot ubuntu01 take ubuntu<sub>basic</sub><sub>ssh</sub>
</p>

<p>
VBoxManage snapshot ubuntu01 list
</p>

<p>
VBoxManage snapshot ubuntu01 delete ubuntu<sub>basic</sub>
</p>

<p>
VBoxManage snapshot ubuntu01 restore ubuntu<sub>basic</sub><sub>ssh</sub>
</p></li>

<li><p>
clone vm
</p>

<p>
VBoxManage clonevm  Centos701 &#x2013;snapshot  centos7<sub>basic</sub>  &#x2013;name Centos<sub>basic</sub>
</p></li>
</ul>

<pre class="example">

查看当前虚拟机  VBoxManage list vms  

查看当前正在运行的虚拟机  VBoxManage list runningvms  

启动虚拟机  VBoxManage startvm 虚拟机名  

无前端图形界面方式启动虚拟机  VBoxManage startvm 虚拟机名 --type headless  

</pre>
</div>
</div>

<div id="outline-container-orgb393f55" class="outline-2">
<h2 id="orgb393f55"><span class="section-number-2">2</span> centos7 basic environment</h2>
<div class="outline-text-2" id="text-2">
<p>
centos7 镜像<a href="http://isoredirect.centos.org/centos/7/isos/x86_64/CentOS-7-x86_64-Minimal-1708.iso">下载</a>
</p>
</div>

<div id="outline-container-org9478a1b" class="outline-3">
<h3 id="org9478a1b"><span class="section-number-3">2.1</span> lvm</h3>
<div class="outline-text-3" id="text-2-1">
<p>
在文件中添加要挂载的分区和文件目录可以修改文件
</p>

<p>
/etc/fstab
</p>

<p>
<i>dev/sda5</i>    media/win    ntfs    defaults   02
</p>

<p>
然后 mount -a
</p>

<ol class="org-ol">
<li><p>
查看几块硬盘
</p>

<p>
sudo fdisk -l |grep sd
</p></li>

<li><p>
创建分区
</p>

<p>
虚拟机现有20g的硬盘,使用fdisk划分磁盘
</p>

<p>
sudo fdisk /dev/sda
</p>

<p class="verse">
m  帮助信息<br />
n 创建分区<br />
e 扩展分区    +5G  pppp/pppe<br />
p 打印分区<br />
t 分区类型 L  (lvm)<br />
w 写入保存分区<br />
</p></li>

<li>格式化 分区</li>

<li><p>
LVM
pv &#x2013;&gt; vg &#x2013;&gt; lv
参考:
<a href="http://blog.sina.com.cn/s/blog_b77735d20101e5cn.html">http://blog.sina.com.cn/s/blog_b77735d20101e5cn.html</a>
<a href="http://aurthurxlc.github.io/Aurthur-2017/Centos-7-extend-lvm-volume.html">http://aurthurxlc.github.io/Aurthur-2017/Centos-7-extend-lvm-volume.html</a>
</p>

<pre class="example">
fdisk -l | grep sd
fdisk /dev/sda
partprobe
pvdisplay
pvcreate /dev/sda3
vgdisplay
vgextend centos /dev/sda3
lvdisplay
#lvcreate -L 3.31G -n manue1 centos
#mkfs.xfs /dev/centos/manue1
#lvremove -f /dev/centos/manue1
lvextend -l +100%FREE /dev/centos/root
df -Th
xfs_growfs /dev/centos/root
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org96e4fed" class="outline-3">
<h3 id="org96e4fed"><span class="section-number-3">2.2</span> ip</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><p>
联网方式: 配置三张网卡
</p>

<ol class="org-ol">
<li>NAT 
网卡1 用来连接外网</li>
<li><p>
Host-only
用来配置静态IP 配置集群服务的时候不需要修改IP
vi <i>etc/sysconfig/network-scripts</i>  
</p>
<pre class="example">
#static assignment
ONBOOT=yes
BOOTPROTO=static
IPADDR=192.168.56.10
NETMASK=255.255.255.0
GATEWAY=192.168.56.1
</pre></li>
<li>Bridge
vbox 自动配置IP，也很方便</li>
</ol>

<p>
这边打算使用网卡1 nat模式连接外网，网卡3的桥接模式与局域网内其他主机通信,网卡二的主机模式搭建集群
</p>

<p>
注意： 网卡二和网卡三的 gateway 字段要注释掉
</p>

<p>
sudo service network restart
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orga0f2035" class="outline-3">
<h3 id="orga0f2035"><span class="section-number-3">2.3</span> sshd</h3>
<div class="outline-text-3" id="text-2-3">
<p>
ssh 连接异常慢
</p>

<p>
sudo vi /etc/ssh/sshd<sub>config</sub>
</p>

<pre class="example">
UseDNS no

</pre>
</div>
</div>

<div id="outline-container-org34481cb" class="outline-3">
<h3 id="org34481cb"><span class="section-number-3">2.4</span> hostname</h3>
<div class="outline-text-3" id="text-2-4">
<p>
永久修改主机名字
</p>

<p>
sudo hostnamectl &#x2013;static set-hostname master
</p>

<p>
sudo vi /etc/hosts
</p>

<pre class="example">
[manue1@localhost ~]$ cat /etc/hostname
 master
[manue1@localhost ~]$ cat /etc/hosts
 127.0.0.1 master
 ::1 master
</pre>
</div>
</div>


<div id="outline-container-org6940d1d" class="outline-3">
<h3 id="org6940d1d"><span class="section-number-3">2.5</span> yum source</h3>
<div class="outline-text-3" id="text-2-5">
<p>
sudo yum -y install wget
</p>

<ul class="org-ul">
<li><p>
备份
</p>

<p>
sudo mv /etc/yum.repos.d/CentOS-Base.repo /etc/yum.repos.d/CentOS-Base.repo.backup
</p></li>

<li><p>
设置aliyun source
</p>

<p>
sudo wget -O /etc/yum.repos.d/CentOS-Base.repo <a href="http://mirrors.aliyun.com/repo/Centos-7.repo">http://mirrors.aliyun.com/repo/Centos-7.repo</a>
</p></li>

<li><p>
设置EPLEPEL source
</p>

<p>
sudo wget -P <i>etc/yum.repos.d</i> <a href="http://mirrors.aliyun.com/repo/epel-7.repo">http://mirrors.aliyun.com/repo/epel-7.repo</a>
</p>

<p>
添加后可以像fedora上 yum install packname
</p></li>

<li><p>
清理缓存并生成新的缓存
</p>

<p>
sudo yum clean all  
</p>

<p>
sudo yum makecache  
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org9a88a7c" class="outline-3">
<h3 id="org9a88a7c"><span class="section-number-3">2.6</span> ntp</h3>
<div class="outline-text-3" id="text-2-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">master</th>
<th scope="col" class="org-left">server</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">slave01</td>
<td class="org-left">client</td>
</tr>

<tr>
<td class="org-left">slave02</td>
<td class="org-left">client</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><p>
any nodes
</p>

<p>
sudo yum -y install ntp
</p>

<p>
timedatectl set-timezone Asia/Shanghai   # 设置上海时区
</p></li>

<li><p>
server configural
</p>

<p>
systemctl start ntpd
</p>

<p>
systemctl enable ntpd
</p>

<p>
vi /etc/ntp.conf 
</p>

<pre class="example">

restrict 192.168.56.0 mask 255.255.0.0

server 127.127.1.0

fudge 127.127.1.0 stratum 10
</pre>

<p>
systemctl restart ntpd
</p>

<ul class="org-ul">
<li><p>
client configural
</p>

<p>
systemctl start ntpd
</p>

<p>
systemctl enable ntpd
</p>

<p>
vi /etc/ntp.conf
</p>

<pre class="example">
server 192.168.56.10

</pre>

<p>
netstat -anp | grep 123
</p></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org421fd17" class="outline-3">
<h3 id="org421fd17"><span class="section-number-3">2.7</span> firewallds</h3>
<div class="outline-text-3" id="text-2-7">
<dl class="org-dl">
<dt>查看状态</dt><dd>systemctl status firewalld</dd>
<dt>关闭</dt><dd>systemctl stop firewalld</dd>
<dt>禁用</dt><dd>systemctl disable firewalld</dd>
</dl>
</div>
</div>
<div id="outline-container-orge8fb225" class="outline-3">
<h3 id="orge8fb225"><span class="section-number-3">2.8</span> disable selinux</h3>
<div class="outline-text-3" id="text-2-8">
<p>
一款为了提高系统安全性的软件：对系统服务，文件权限，网络端口访问有极其严格的限制，
例如：如果对一个文件没有正确安全上下文配置， 甚至你是root用户，你也不能启动某服务
</p>

<p>
sudo vi /etc/sysconfig/selinux
</p>
<pre class="example">
selinux = disable

</pre>
</div>
</div>
