note/note-linux-centos.org
** java  & scala
  基础环境用root 配置在/etc/profile 自启动环境文件内

  refer : [[https://www.mtyun.com/library/how-to-setup-scala-on-centos7][1]]

  - java rpm install

    1. [[http://www.oracle.com/technetwork/java/javase/downloads/index.html][download]]
    2. install
       #+BEGIN_VERSE
       sudo rpm -ivh jdk-8u144-linux-x64.rpm
       sudo rpm -aq | grep jdk
       sudo rpm -e jdk   无效
       sudo yum remove jdk  
       #+END_VERSE

       sudo vi /etc/profile

       #+BEGIN_SRC 
         #JAVA_HOME
         export JAVA_HOME=/usr/java/jdk1.8.0_144
         export CLASSPATH=.:$JAVA_HOME/jre/lib/rt.jar:$JAVA_HOME/lib/dt.jar:$JAVA_HOME/lib/tools.jar
         export PATH=$PATH:$JAVA_HOME/bin
       #+END_SRC
  - java 离线包安装
    
    tar -zxvf jdk-8u151-linux-x64.tar.gz

    vi /etc/profile
    #+BEGIN_SRC 
#JAVA_HOME
JAVA_HOME=/home/manue1/opt/jdk8
PATH=$PATH:$JAVA_HOME/bin
export JAVA_HOME PATH
    #+END_SRC
  - scala 离线包安装

    当前最新版本

    tar zxvf scala-2.11.7.tgz

    #+BEGIN_SRC 
    SCALA_HOME=/home/manue1/opt/scala-2.11.7
    PATH=$PATH:$SCALA_HOME/bin
    export SCALA_HOME PATH
    #+END_SRC
    
* hadoop 集群配置
** hadoop hbase spark 版本选择
   + hbase 支持 hadoop 版本对照表
   
      The 1.2.x series is the current stable release line
     
      http://www-us.apache.org/dist/hbase/
     
      下面查看1.2.x 需要的hadoop版本
   
      http://hbase.apache.org/book.html#arch.overview
   
      crtl + F  "s" 搜索页面
   
     选择 Hadoop-2.7.1+
     
   + spark 支持 hadoop
     
     http://spark.apache.org/downloads.html
     
     官方下载页面可以手动选择
   
   + hive 支持 hadoop
     
     https://hive.apache.org/downloads.html
   
     稳定版下载地址
     
     http://mirrors.shuosc.org/apache/hive/stable-2/
   
   + zookeeper
       
       下载稳定版即可
       
       http://mirrors.shuosc.org/apache/zookeeper/stable/

** 环境准备
   三台vbox 虚拟centos7 配置 java scala 环境 关闭防火墙和selinux
   
   - cluster
     | hostname |            ip |
     |----------+---------------|
     | master   | 192.168.56.10 |
     |----------+---------------|
     | slave01  | 192.168.56.11 |
     |----------+---------------|
     | slave02  | 192.168.56.12 |
     |----------+---------------|
     
   - disable ipv6

     sudo vi /etc/sysctl.conf
     
     添加下面内容
     
     #+BEGIN_SRC 

# disable ipv6
net.ipv6.conf.all.disable_ipv6 = 1
net.ipv6.conf.default.disable_ipv6 = 1
net.ipv6.conf.lo.disable_ipv6 = 1
     
     #+END_SRC

     解决master:50070 页面找不到live node 

     解决 connection exception
     
     #+BEGIN_SRC 
17//23 23:19:48 WARN util.NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
ls:all From slave01/127.0.0.1 to master:9000 failed on connection exception: java.net.ConnectException: 拒绝连接; For more details see:  http://wiki.apache.org/hadoop/ConnectionRefused
     
     #+END_SRC

   - hostname & host

     三台主机都要,修改主机名,修改/etc/hosts 互相添加hostname访问别名

     注意； #127.0.0.1 master 这样的映射一定要注释掉,master:8088无法访问最终定位到这里了
     #+BEGIN_SRC 
#ceos7 cluster
19268.56.10 master
19268.56.11 slave01
19268.56.12 slave02
     #+END_SRC

   - 免登录验证
     #+BEGIN_VERSE
     ssh-keygen -t rsa
     ssh-copy-id -i ~/.ssh/id_rsa.pub manue1@slave01 
     ssh-copy-id -i ~/.ssh/id_rsa.pub manue1@slave02 
     ssh-copy-id -i ~/.ssh/id_rsa.pub manue1@master
     #+END_VERSE
     
   - download hadoop
       tar -zxvf hadoop-2.7.5.tar.gz
