note/note-linux-centos.html
<div id="outline-container-org4b7d787" class="outline-3">
<h3 id="org4b7d787"><span class="section-number-3">2.9</span> java  &amp; scala</h3>
<div class="outline-text-3" id="text-2-9">
<p>
基础环境用root 配置在/etc/profile 自启动环境文件内
</p>

<p>
refer : <a href="https://www.mtyun.com/library/how-to-setup-scala-on-centos7">1</a>
</p>

<ul class="org-ul">
<li>java rpm install

<ol class="org-ol">
<li><a href="http://www.oracle.com/technetwork/java/javase/downloads/index.html">download</a></li>
<li><p>
install
</p>
<p class="verse">
sudo rpm -ivh jdk-8u144-linux-x64.rpm<br />
sudo rpm -aq | grep jdk<br />
sudo rpm -e jdk   无效<br />
sudo yum remove jdk<br />
</p>

<p>
sudo vi /etc/profile
</p>

<pre class="example">
#JAVA_HOME
export JAVA_HOME=/usr/java/jdk1.8.0_144
export CLASSPATH=.:$JAVA_HOME/jre/lib/rt.jar:$JAVA_HOME/lib/dt.jar:$JAVA_HOME/lib/tools.jar
export PATH=$PATH:$JAVA_HOME/bin
</pre></li>
</ol></li>
<li><p>
java 离线包安装
</p>

<p>
tar -zxvf jdk-8u151-linux-x64.tar.gz
</p>

<p>
vi /etc/profile
</p>
<pre class="example">
#JAVA_HOME
JAVA_HOME=/home/manue1/opt/jdk8
PATH=$PATH:$JAVA_HOME/bin
export JAVA_HOME PATH
</pre></li>
<li><p>
scala 离线包安装
</p>

<p>
当前最新版本
</p>

<p>
tar zxvf scala-2.11.7.tgz
</p>

<pre class="example">
SCALA_HOME=/home/manue1/opt/scala-2.11.7
PATH=$PATH:$SCALA_HOME/bin
export SCALA_HOME PATH
</pre></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd7d61fe" class="outline-2">
<h2 id="orgd7d61fe"><span class="section-number-2">3</span> hadoop 集群配置</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org111cbbf" class="outline-3">
<h3 id="org111cbbf"><span class="section-number-3">3.1</span> hadoop hbase spark 版本选择</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><p>
hbase 支持 hadoop 版本对照表
</p>

<p>
The 1.2.x series is the current stable release line
</p>

<p>
<a href="http://www-us.apache.org/dist/hbase/">http://www-us.apache.org/dist/hbase/</a>
</p>

<p>
下面查看1.2.x 需要的hadoop版本
</p>

<p>
<a href="http://hbase.apache.org/book.html#arch.overview">http://hbase.apache.org/book.html#arch.overview</a>
</p>

<p>
crtl + F  "s" 搜索页面
</p>

<p>
选择 Hadoop-2.7.1+
</p></li>

<li><p>
spark 支持 hadoop
</p>

<p>
<a href="http://spark.apache.org/downloads.html">http://spark.apache.org/downloads.html</a>
</p>

<p>
官方下载页面可以手动选择
</p></li>

<li><p>
hive 支持 hadoop
</p>

<p>
<a href="https://hive.apache.org/downloads.html">https://hive.apache.org/downloads.html</a>
</p>

<p>
稳定版下载地址
</p>

<p>
<a href="http://mirrors.shuosc.org/apache/hive/stable-2/">http://mirrors.shuosc.org/apache/hive/stable-2/</a>
</p></li>

<li><p>
zookeeper
</p>

<p>
下载稳定版即可
</p>

<p>
<a href="http://mirrors.shuosc.org/apache/zookeeper/stable/">http://mirrors.shuosc.org/apache/zookeeper/stable/</a>
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org8564b3a" class="outline-3">
<h3 id="org8564b3a"><span class="section-number-3">3.2</span> 环境准备</h3>
<div class="outline-text-3" id="text-3-2">
<p>
三台vbox 虚拟centos7 配置 java scala 环境 关闭防火墙和selinux
</p>

<ul class="org-ul">
<li><p>
cluster
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">hostname</th>
<th scope="col" class="org-right">ip</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">master</td>
<td class="org-right">192.168.56.10</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">slave01</td>
<td class="org-right">192.168.56.11</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">slave02</td>
<td class="org-right">192.168.56.12</td>
</tr>
</tbody>
</table></li>

<li><p>
disable ipv6
</p>

<p>
sudo vi /etc/sysctl.conf
</p>

<p>
添加下面内容
</p>

<pre class="example">

# disable ipv6
net.ipv6.conf.all.disable_ipv6 = 1
net.ipv6.conf.default.disable_ipv6 = 1
net.ipv6.conf.lo.disable_ipv6 = 1

</pre>

<p>
解决master:50070 页面找不到live node 
</p>

<p>
解决 connection exception
</p>

<pre class="example">
17//23 23:19:48 WARN util.NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
ls:all From slave01/127.0.0.1 to master:9000 failed on connection exception: java.net.ConnectException: 拒绝连接; For more details see:  http://wiki.apache.org/hadoop/ConnectionRefused

</pre></li>

<li><p>
hostname &amp; host
</p>

<p>
三台主机都要,修改主机名,修改/etc/hosts 互相添加hostname访问别名
</p>

<p>
注意； #127.0.0.1 master 这样的映射一定要注释掉,master:8088无法访问最终定位到这里了
</p>
<pre class="example">
#ceos7 cluster
19268.56.10 master
19268.56.11 slave01
19268.56.12 slave02
</pre></li>

<li><p>
免登录验证
</p>
<p class="verse">
ssh-keygen -t rsa<br />
ssh-copy-id -i ~/.ssh/id<sub>rsa.pub</sub> manue1@slave01<br />
ssh-copy-id -i ~/.ssh/id<sub>rsa.pub</sub> manue1@slave02<br />
ssh-copy-id -i ~/.ssh/id<sub>rsa.pub</sub> manue1@master<br />
</p></li>

<li>download hadoop
tar -zxvf hadoop-2.7.5.tar.gz</li>
</ul>
</div>
</div>
