note/note-linux-centos.org
** 配置hadoop cluster
     
    - hadoop_home
      三台节点都需要配置

      vi .bashrc
      #+BEGIN_SRC 
# Hadoop Environment Variables
export HADOOP_HOME=/home/manue1/opt/hadoop-2.7.5
export HADOOP_INSTALL=$HADOOP_HOME
export HADOOP_MAPRED_HOME=$HADOOP_HOME
export HADOOP_COMMON_HOME=$HADOOP_HOME
export HADOOP_HDFS_HOME=$HADOOP_HOME
export YARN_HOME=$HADOOP_HOME
export HADOOP_COMMON_LIB_NATIVE_DIR=$HADOOP_HOME/lib/native
export PATH=$PATH:$HADOOP_HOME/sbin:$HADOOP_HOME/bin
export HADOOP_OPTS="$HADOOP_OPTS -Djava.library.path=$HADOOP_HOME/lib/native" #解决WARN util.NativeCodeLoader: Unable to load native-hadoop library
export CATALINA_BASE=$HADOOP_HOME/share/hadoop/httpfs/tomcat #支持httpfs rest api
      
      #+END_SRC

    - master
      
      /home/manue1/opt/hadoop-2.7.5/etc/hadoop/ 下6个配置文件

      1. core-site.xml

         #+BEGIN_SRC 
<configuration>
    <!-- 指定HDFS老大（namenode）的通信地址 -->
    <property>
        <name>fs.defaultFS</name>
        <value>hdfs://master:9000</value>
    </property>
    <!-- 指定hadoop运行时产生文件的存储路径 -->
    <property>
        <name>hadoop.tmp.dir</name>
        <value>file:/home/manue1/opt/hadoop-2.7.5/tmp</value>
    </property>
</configuration>
    <!--开启httpfs实现一种匿名的方式登陆hdfs文件系统 端口14000
        manue1用户为hdfs的超级用户 hive启动用户
    -->

    <property>
         <name>hadoop.proxyuser.manue1.hosts</name>
         <value>*</value>
    </property>
    <property>
        <name>hadoop.proxyuser.manue1.groups</name>
        <value>*</value>
    </property>

         
         #+END_SRC

      2. hdfs-site.xml
         
         #+BEGIN_SRC 
<configuration>
        <!-- 设置namenode的http通讯地址 -->
        <property>
                <name>dfs.namenode.secondary.http-address</name>
                <value>master:50090</value>
        </property>
        <!-- 设置hdfs副本数量 -->
        <property>
                <name>dfs.replication</name>
                <value>1</value>
        </property>
         <!-- 设置namenode存放的路径 -->
        <property>
                <name>dfs.namenode.name.dir</name>
                <value>file:/home/manue1/opt/hadoop-2.7.5/tmp/dfs/name</value>
        </property>
         <!-- 设置datanode存放的路径 -->
        <property>
                <name>dfs.datanode.data.dir</name>
                <value>file:/home/manue1/opt/hadoop-2.7.5/tmp/dfs/data</value>
        </property>
</configuration>

         
         #+END_SRC

      3. mapred-site.xml
         
         mv mapred-site.xml.template mapred-site.xml

         #+BEGIN_SRC 
<configuration>
        <!-- 通知框架MR使用YARN -->
        <property>
                <name>mapreduce.framework.name</name>
                <value>yarn</value>
        </property>
        <property>
                <name>mapreduce.jobhistory.address</name>
                <value>master:10020</value>
        </property>
        <property>
                <name>mapreduce.jobhistory.webapp.address</name>
                <value>master:19888</value>
        </property>
</configuration>
         
         #+END_SRC
         
      4. yarn-site.xml
         
         #+BEGIN_SRC 
<configuration>
 <!-- 设置 resourcemanager 在哪个节点-->
<!-- Site specific YARN configuration properties -->
        <property>
                <name>yarn.resourcemanager.hostname</name>
                <value>master</value>
        </property>
         <!-- reducer取数据的方式是mapreduce_shuffle -->
        <property>
                <name>yarn.nodemanager.aux-services</name>
                <value>mapreduce_shuffle</value>
        </property>
        <!--所有主机访问yarn管理界面-->
        <property> 
                <name>yarn.resourcemanager.webapp.address</name>
                <value>0.0.0.0:8088</value>
        </property>

</configuration>
         
         #+END_SRC

      5. slaves
         
         #+BEGIN_SRC 
         slave01
         slave02
         #+END_SRC
         
      6. hadoop-env.sh

         修改
         export JAVA_HOME=/home/manue1/opt/jdk8
         
    - slaves
      
      复制master节点配置好的安装包到指定slaves目录
      
      : tar -zcvf hadoop-2.7.5_conf_finshed.tar.gz hadoop-2.7.5/
      : scp hadoop-2.7.5_conf_finshed.tar.gz manue1@slave02:/home/manue1/opt/

** 启动hadoop

   第一次启动要执行格式化，之后启动不用执行这条
   : hdfs namenode -format 
   
   启动命令:
   : start-dfs.sh
   : start-yarn.sh
   : mr-jobhistory-daemon.sh start historyserver  ??
   : httpfs.sh start


   - master
       #+BEGIN_SRC 
manue1@master sbin]$ jps
2034 NameNode
2483 Jps
15754 Bootstrap  #httpfs
1652 ResourceManager
2188 SecondaryNameNode
2447 JobHistoryServer
       
       #+END_SRC
       
   - slaves
       #+BEGIN_SRC 
[manue1@slave01 hadoop]$ jps
1360 DataNode
1430 NodeManager
1516 Jps
       #+END_SRC

  hadoop cluster状态展示界面 webhdfs

  : http://master:50070/
  : curl "http://master:50070/webhdfs/v1/?op=liststatus&user.name=manue1"
  
  httpfs rest api 配置HA的时候找不到namenode可以采用httpfs

  : http://master:14000/
  : curl "http://master:14000/webhdfs/v1/?op=liststatus&user.name=manue1"

  yarn 管理界面

  : http://master:8088

* elasticstk 集群
