note/note-linux-centos.html
<div id="outline-container-orga2c20cb" class="outline-3">
<h3 id="orga2c20cb"><span class="section-number-3">3.3</span> 配置hadoop cluster</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><p>
hadoop<sub>home</sub>
三台节点都需要配置
</p>

<p>
vi .bashrc
</p>
<pre class="example">
# Hadoop Environment Variables
export HADOOP_HOME=/home/manue1/opt/hadoop-2.7.5
export HADOOP_INSTALL=$HADOOP_HOME
export HADOOP_MAPRED_HOME=$HADOOP_HOME
export HADOOP_COMMON_HOME=$HADOOP_HOME
export HADOOP_HDFS_HOME=$HADOOP_HOME
export YARN_HOME=$HADOOP_HOME
export HADOOP_COMMON_LIB_NATIVE_DIR=$HADOOP_HOME/lib/native
export PATH=$PATH:$HADOOP_HOME/sbin:$HADOOP_HOME/bin
export HADOOP_OPTS="$HADOOP_OPTS -Djava.library.path=$HADOOP_HOME/lib/native" #解决WARN util.NativeCodeLoader: Unable to load native-hadoop library
export CATALINA_BASE=$HADOOP_HOME/share/hadoop/httpfs/tomcat #支持httpfs rest api

</pre></li>

<li><p>
master
</p>

<p>
<i>home/manue1/opt/hadoop-2.7.5/etc/hadoop</i> 下6个配置文件
</p>

<ol class="org-ol">
<li><p>
core-site.xml
</p>

<pre class="example">
&lt;configuration&gt;
    &lt;!-- 指定HDFS老大（namenode）的通信地址 --&gt;
    &lt;property&gt;
        &lt;name&gt;fs.defaultFS&lt;/name&gt;
        &lt;value&gt;hdfs://master:9000&lt;/value&gt;
    &lt;/property&gt;
    &lt;!-- 指定hadoop运行时产生文件的存储路径 --&gt;
    &lt;property&gt;
        &lt;name&gt;hadoop.tmp.dir&lt;/name&gt;
        &lt;value&gt;file:/home/manue1/opt/hadoop-2.7.5/tmp&lt;/value&gt;
    &lt;/property&gt;
&lt;/configuration&gt;
    &lt;!--开启httpfs实现一种匿名的方式登陆hdfs文件系统 端口14000
        manue1用户为hdfs的超级用户 hive启动用户
    --&gt;

    &lt;property&gt;
         &lt;name&gt;hadoop.proxyuser.manue1.hosts&lt;/name&gt;
         &lt;value&gt;*&lt;/value&gt;
    &lt;/property&gt;
    &lt;property&gt;
        &lt;name&gt;hadoop.proxyuser.manue1.groups&lt;/name&gt;
        &lt;value&gt;*&lt;/value&gt;
    &lt;/property&gt;


</pre></li>

<li><p>
hdfs-site.xml
</p>

<pre class="example">
&lt;configuration&gt;
        &lt;!-- 设置namenode的http通讯地址 --&gt;
        &lt;property&gt;
                &lt;name&gt;dfs.namenode.secondary.http-address&lt;/name&gt;
                &lt;value&gt;master:50090&lt;/value&gt;
        &lt;/property&gt;
        &lt;!-- 设置hdfs副本数量 --&gt;
        &lt;property&gt;
                &lt;name&gt;dfs.replication&lt;/name&gt;
                &lt;value&gt;1&lt;/value&gt;
        &lt;/property&gt;
         &lt;!-- 设置namenode存放的路径 --&gt;
        &lt;property&gt;
                &lt;name&gt;dfs.namenode.name.dir&lt;/name&gt;
                &lt;value&gt;file:/home/manue1/opt/hadoop-2.7.5/tmp/dfs/name&lt;/value&gt;
        &lt;/property&gt;
         &lt;!-- 设置datanode存放的路径 --&gt;
        &lt;property&gt;
                &lt;name&gt;dfs.datanode.data.dir&lt;/name&gt;
                &lt;value&gt;file:/home/manue1/opt/hadoop-2.7.5/tmp/dfs/data&lt;/value&gt;
        &lt;/property&gt;
&lt;/configuration&gt;


</pre></li>

<li><p>
mapred-site.xml
</p>

<p>
mv mapred-site.xml.template mapred-site.xml
</p>

<pre class="example">
&lt;configuration&gt;
        &lt;!-- 通知框架MR使用YARN --&gt;
        &lt;property&gt;
                &lt;name&gt;mapreduce.framework.name&lt;/name&gt;
                &lt;value&gt;yarn&lt;/value&gt;
        &lt;/property&gt;
        &lt;property&gt;
                &lt;name&gt;mapreduce.jobhistory.address&lt;/name&gt;
                &lt;value&gt;master:10020&lt;/value&gt;
        &lt;/property&gt;
        &lt;property&gt;
                &lt;name&gt;mapreduce.jobhistory.webapp.address&lt;/name&gt;
                &lt;value&gt;master:19888&lt;/value&gt;
        &lt;/property&gt;
&lt;/configuration&gt;

</pre></li>

<li><p>
yarn-site.xml
</p>

<pre class="example">
&lt;configuration&gt;
 &lt;!-- 设置 resourcemanager 在哪个节点--&gt;
&lt;!-- Site specific YARN configuration properties --&gt;
        &lt;property&gt;
                &lt;name&gt;yarn.resourcemanager.hostname&lt;/name&gt;
                &lt;value&gt;master&lt;/value&gt;
        &lt;/property&gt;
         &lt;!-- reducer取数据的方式是mapreduce_shuffle --&gt;
        &lt;property&gt;
                &lt;name&gt;yarn.nodemanager.aux-services&lt;/name&gt;
                &lt;value&gt;mapreduce_shuffle&lt;/value&gt;
        &lt;/property&gt;
        &lt;!--所有主机访问yarn管理界面--&gt;
        &lt;property&gt; 
                &lt;name&gt;yarn.resourcemanager.webapp.address&lt;/name&gt;
                &lt;value&gt;0.0.0.0:8088&lt;/value&gt;
        &lt;/property&gt;

&lt;/configuration&gt;

</pre></li>

<li><p>
slaves
</p>

<pre class="example">
slave01
slave02
</pre></li>

<li><p>
hadoop-env.sh
</p>

<p>
修改
export JAVA<sub>HOME</sub>=/home/manue1/opt/jdk8
</p></li>
</ol></li>

<li><p>
slaves
</p>

<p>
复制master节点配置好的安装包到指定slaves目录
</p>

<pre class="example">
tar -zcvf hadoop-2.7.5_conf_finshed.tar.gz hadoop-2.7.5/
scp hadoop-2.7.5_conf_finshed.tar.gz manue1@slave02:/home/manue1/opt/

</pre></li>
</ul>
</div>
</div>

<div id="outline-container-org36ba49a" class="outline-3">
<h3 id="org36ba49a"><span class="section-number-3">3.4</span> 启动hadoop</h3>
<div class="outline-text-3" id="text-3-4">
<p>
第一次启动要执行格式化，之后启动不用执行这条
</p>
<pre class="example">
hdfs namenode -format 

</pre>

<p>
启动命令:
</p>
<pre class="example">
start-dfs.sh
start-yarn.sh
mr-jobhistory-daemon.sh start historyserver  ??
httpfs.sh start

</pre>


<ul class="org-ul">
<li><p>
master
</p>
<pre class="example">
manue1@master sbin]$ jps
2034 NameNode
2483 Jps
15754 Bootstrap  #httpfs
1652 ResourceManager
2188 SecondaryNameNode
2447 JobHistoryServer

</pre></li>

<li><p>
slaves
</p>
<pre class="example">
[manue1@slave01 hadoop]$ jps
1360 DataNode
1430 NodeManager
1516 Jps
</pre></li>
</ul>

<p>
hadoop cluster状态展示界面 webhdfs
</p>

<pre class="example">
http://master:50070/
curl "http://master:50070/webhdfs/v1/?op=liststatus&amp;user.name=manue1"

</pre>

<p>
httpfs rest api 配置HA的时候找不到namenode可以采用httpfs
</p>

<pre class="example">
http://master:14000/
curl "http://master:14000/webhdfs/v1/?op=liststatus&amp;user.name=manue1"

</pre>

<p>
yarn 管理界面
</p>

<pre class="example">
http://master:8088

</pre>
</div>
</div>
</div>
