note/note-linux-centos.org
** elasticsearch-611
   #+BEGIN_QUOTE
   1. 环境准备
        
     | hostname |            ip |            |
     |----------+---------------+------------|
     | master   | 192.168.56.10 | masternode |
     |----------+---------------+------------|
     | slave01  | 192.168.56.11 | datanode   |
     |----------+---------------+------------|
     | slave02  | 192.168.56.12 | datanode   |
      
     -  生产环境配置: 

        10节点 6个master候选节点

        1节点 4G + lucene 3G = 8G

        10T硬盘，最多存5T数据

        4c + 8g + 1T * 10台 = 10T 

        4c + 16g + 2T * 5台 = 10T

     - java 环境配置，关闭firewalld,主机名配置,官网下载elasticsearch-6.1.1.tar.gz

     - 普通用户下安装es  username:manue1
       
     - 系统设置

      sudo -s 切换到root下执行

      #+BEGIN_SRC 

sed -e '$a vm.max_map_count = 262144' -i /etc/sysctl.conf

sysctl -p

 

echo "ulimit -SHn 1048576" >> /etc/rc.local

sed -e '$a DefaultLimitCORE=infinity\nDefaultLimitNOFILE=1048576\nDefaultLimitNPROC=1048576' -i /etc/systemd/system.conf

cat >> /etc/security/limits.conf << EOF

 *           soft   nofile       1048576

 *           hard   nofile       1048576

 *           soft   nproc        1048576

 *           hard   nproc        1048576

EOF

sed -i 's/4096/1048576/' /etc/security/limits.d/20-nproc.conf

sed -e '/root       soft    nproc     unlimited/a\*           soft   nofile       1048576\n*           hard   nofile       1048576' -i /etc/security/limits.d/20-nproc.conf
      
      #+END_SRC

      修改系统配置文件后，重启系统生效
      
   2. 配置elasticsearch
      
     - elasticsearch.yml          # els的配置文件
       
       #+BEGIN_SRC 
cluster.name: manue1-es-cluster  #集群名称

node.name: master-node           #节点名称

node.data: false
node.master: true  #建议直接不设置，默认两个都为true.

path.data: /Home/Manue1/Opt/Elasticsearch-6.1.1/Els/Data  #数据存储目录

path.logs: /home/manue1/opt/elasticsearch-6.1.1/els/log   #日志存储目录

network.bind_host: 0.0.0.0   #master节点配置 ”0.0.0.0”，允许所有网络接口访问
network.publish_host: master # 集群通信

gateway.recover_after_nodes: 3  #值为n，网关控制在n个节点启动之后才恢复整个集群, 3节>点启动后1分钟
gateway.recover_after_time: 1m

indices.recovery.max_bytes_per_sec: 20mb  #恢复数据时,限制的宽带流量,如果是0就是无限制

node.max_local_storage_nodes: 1                  #值为n，一个系统中最多启用节点个数为n

http.port: 9200                 # 对外提供服务的端口，9300为集群服务的端口


       #+END_SRC
       
     - jvm.options                # JVM相关的配置，内存大小等等

       #+BEGIN_SRC 
      -Xms128M
      -Xmx128M
      -Xmx1g与-Xms1gJVM的最大最小内存。如果太小会导致Elasticsearch刚刚启动就立刻停止。太大会拖慢系统本身
       #+END_SRC

     - log4j2.properties          # 日志系统定义

     将配置好的elasticsearch 打包传到各个节点，需要注意的是，如果配置过程中运行产生的data/nodes/0 文件
     一定要删掉，再打包使用，否则各个节点启动成功了，无法加入到集群，节点id冲突
     报错信息: =with the same id but is a different node instance=
      
   3. 启动elasticsearch
      
      su manue1

      vi  /home/manue1/opt/elasticsearch-6.1.1/bin/elasticsearch

      #+BEGIN_SRC 
ES_HEAP_SIZE=128m
MAX_OPEN_FILES=262144
      #+END_SRC
      
     nohup ./bin/elasticsearch -d 

     关闭 ps -ef |grep elasticsearch|awk '{print $2}'|xargs kill -9

   4. refer

      [[https://blog.csdn.net/thomas0yang/article/details/55518105#%E5%86%85%E5%AD%98][1]] [[https://www.elastic.co/guide/cn/elasticsearch/guide/cn/important-configuration-changes.html#_%E6%9C%80%E5%B0%8F%E4%B8%BB%E8%8A%82%E7%82%B9%E6%95%B0][2]] [[https://zhuanlan.zhihu.com/p/35291900][3]]

`
   #+END_QUOTE
   
** kibana

   配置在es的非数据节点上: 192.168.56.10

   修改 config/kibana.yml
   #+BEGIN_SRC 
server.host: "0.0.0.0" #不同网卡网段能够访问
elasticsearch.url: "http://master:9200"
   #+END_SRC

   启动： nohup  bin/kibana  &

   关闭: ps -ef |grep kibana |awk '{print $2}'|xargs kill -9

   ss -lnp | grep 5601

** logstash
   1. download
      logstash-6.1.1.tar.gz
   2. config
      
      - 创建logstash-conf 目录
        beat的配置文件
        vi beats.conf
        #+BEGIN_SRC 
input {
  beats {
    port => 5044
  }
}

# The filter part of this file is commented out to indicate that it is
# optional.
# filter {
#
# }

output {
  elasticsearch {
    hosts => "master:9200"
    manage_template => false
    index => "%{[@metadata][beat]}-%{[@metadata][version]}-%{+YYYY.MM.dd}" 
  }
}
        
        #+END_SRC
        
      - jvm.options
        修改 xms xmx 最大最小jvm 为256M 比es测试集群吃内存多 

      - logstash.yml

   3. start logstash

     -  bin/logstash -e 'input { stdin { } } output { stdout {} }'
        测试启动

     - ./bin/logstash -f logstash-conf/beats.conf &
       
       配置文件启动

       sudo netstat -anp | grep 5044
** beats
*** topbeat
    5.x版本后弃用了
    1. 下载
       topbeat-1.3.1-x86_64.tar.gz

    2. 配置

      - topbeat

      - topbeat.template.json  
        topbeat自带的模版，用来创建存放收集数据的索引结构

      - topbeat.yml
        #+BEGIN_SRC 
input:
  period: 10           #默认10秒收集一次
  procs: [".*"]   #定义正则表达式，以匹配你所要监控的进程。默认是所有正在运行的进程都进行监控。
  stats:
    system: true
    proc: true
    filesystem: true
output:
  elasticsearch:
    hosts: ["master:9200"]
shipper:
logging:
  files:
        #+END_SRC
   

    3. es导入模版
       导入topbeat自带的模版，用来创建存放收集数据的索引结构

       - Configuring Template Loading - supported for Elasticsearch output only
         #+BEGIN_SRC 
         ERR Failed to perform any bulk index operations: 406 Not Acceptable
         错误应该是模版和6.0版本不匹配了，官网没有更新
         再去官网查看，topbeat 从5.0 已经被 Metricbeat替换了
         #+END_SRC

       - Loading the Template Manually - required for Logstash output


    4. kibana 

    5. 启动topbeat节点

       sudo ./topbeat -e -c topbeat.yml -d "publish"
