note/note-linux-centos.html

<div id="outline-container-org5534892" class="outline-2">
<h2 id="org5534892"><span class="section-number-2">4</span> elasticstk 集群</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org2df9990" class="outline-3">
<h3 id="org2df9990"><span class="section-number-3">4.1</span> elasticsearch-611</h3>
<div class="outline-text-3" id="text-4-1">
<blockquote>
<ol class="org-ol">
<li><p>
环境准备
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">hostname</th>
<th scope="col" class="org-right">ip</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">master</td>
<td class="org-right">192.168.56.10</td>
<td class="org-left">masternode</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">slave01</td>
<td class="org-right">192.168.56.11</td>
<td class="org-left">datanode</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">slave02</td>
<td class="org-right">192.168.56.12</td>
<td class="org-left">datanode</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><p>
生产环境配置: 
</p>

<p>
10节点 6个master候选节点
</p>

<p>
1节点 4G + lucene 3G = 8G
</p>

<p>
10T硬盘，最多存5T数据
</p>

<p>
4c + 8g + 1T * 10台 = 10T 
</p>

<p>
4c + 16g + 2T * 5台 = 10T
</p></li>

<li>java 环境配置，关闭firewalld,主机名配置,官网下载elasticsearch-6.1.1.tar.gz</li>

<li>普通用户下安装es  username:manue1</li>

<li><p>
系统设置
</p>

<p>
sudo -s 切换到root下执行
</p>

<pre class="example">

sed -e '$a vm.max_map_count = 262144' -i /etc/sysctl.conf

sysctl -p



echo "ulimit -SHn 1048576" &gt;&gt; /etc/rc.local

sed -e '$a DefaultLimitCORE=infinity\nDefaultLimitNOFILE=1048576\nDefaultLimitNPROC=1048576' -i /etc/systemd/system.conf

cat &gt;&gt; /etc/security/limits.conf &lt;&lt; EOF

 *           soft   nofile       1048576

 *           hard   nofile       1048576

 *           soft   nproc        1048576

 *           hard   nproc        1048576

EOF

sed -i 's/4096/1048576/' /etc/security/limits.d/20-nproc.conf

sed -e '/root       soft    nproc     unlimited/a\*           soft   nofile       1048576\n*           hard   nofile       1048576' -i /etc/security/limits.d/20-nproc.conf

</pre>

<p>
修改系统配置文件后，重启系统生效
</p></li>
</ul></li>

<li><p>
配置elasticsearch
</p>

<ul class="org-ul">
<li><p>
elasticsearch.yml          # els的配置文件
</p>

<pre class="example">
cluster.name: manue1-es-cluster  #集群名称

node.name: master-node           #节点名称

node.data: false
node.master: true  #建议直接不设置，默认两个都为true.

path.data: /Home/Manue1/Opt/Elasticsearch-6.1.1/Els/Data  #数据存储目录

path.logs: /home/manue1/opt/elasticsearch-6.1.1/els/log   #日志存储目录

network.bind_host: 0.0.0.0   #master节点配置 ”0.0.0.0”，允许所有网络接口访问
network.publish_host: master # 集群通信

gateway.recover_after_nodes: 3  #值为n，网关控制在n个节点启动之后才恢复整个集群, 3节&gt;点启动后1分钟
gateway.recover_after_time: 1m

indices.recovery.max_bytes_per_sec: 20mb  #恢复数据时,限制的宽带流量,如果是0就是无限制

node.max_local_storage_nodes: 1                  #值为n，一个系统中最多启用节点个数为n

http.port: 9200                 # 对外提供服务的端口，9300为集群服务的端口


</pre></li>

<li><p>
jvm.options                # JVM相关的配置，内存大小等等
</p>

<pre class="example">
-Xms128M
-Xmx128M
-Xmx1g与-Xms1gJVM的最大最小内存。如果太小会导致Elasticsearch刚刚启动就立刻停止。太大会拖慢系统本身
</pre></li>

<li>log4j2.properties          # 日志系统定义</li>
</ul>

<p>
将配置好的elasticsearch 打包传到各个节点，需要注意的是，如果配置过程中运行产生的data/nodes/0 文件
一定要删掉，再打包使用，否则各个节点启动成功了，无法加入到集群，节点id冲突
报错信息: <code>with the same id but is a different node instance</code>
</p></li>

<li><p>
启动elasticsearch
</p>

<p>
su manue1
</p>

<p>
vi  /home/manue1/opt/elasticsearch-6.1.1/bin/elasticsearch
</p>

<pre class="example">
ES_HEAP_SIZE=128m
MAX_OPEN_FILES=262144
</pre>

<p>
nohup ./bin/elasticsearch -d 
</p>

<p>
关闭 ps -ef |grep elasticsearch|awk '{print $2}'|xargs kill -9
</p></li>

<li><p>
refer
</p>

<p>
<a href="https://blog.csdn.net/thomas0yang/article/details/55518105#%E5%86%85%E5%AD%98">1</a> <a href="https://www.elastic.co/guide/cn/elasticsearch/guide/cn/important-configuration-changes.html#_%E6%9C%80%E5%B0%8F%E4%B8%BB%E8%8A%82%E7%82%B9%E6%95%B0">2</a> <a href="https://zhuanlan.zhihu.com/p/35291900">3</a>
</p></li>
</ol>

<p>
`
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgadc077b" class="outline-3">
<h3 id="orgadc077b"><span class="section-number-3">4.2</span> kibana</h3>
<div class="outline-text-3" id="text-4-2">
<p>
配置在es的非数据节点上: 192.168.56.10
</p>

<p>
修改 config/kibana.yml
</p>
<pre class="example">
server.host: "0.0.0.0" #不同网卡网段能够访问
elasticsearch.url: "http://master:9200"
</pre>

<p>
启动： nohup  bin/kibana  &amp;
</p>

<p>
关闭: ps -ef |grep kibana |awk '{print $2}'|xargs kill -9
</p>

<p>
ss -lnp | grep 5601
</p>
</div>
</div>

<div id="outline-container-org076e19f" class="outline-3">
<h3 id="org076e19f"><span class="section-number-3">4.3</span> logstash</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>download
logstash-6.1.1.tar.gz</li>
<li>config

<ul class="org-ul">
<li><p>
创建logstash-conf 目录
beat的配置文件
vi beats.conf
</p>
<pre class="example">
input {
  beats {
    port =&gt; 5044
  }
}

# The filter part of this file is commented out to indicate that it is
# optional.
# filter {
#
# }

output {
  elasticsearch {
    hosts =&gt; "master:9200"
    manage_template =&gt; false
    index =&gt; "%{[@metadata][beat]}-%{[@metadata][version]}-%{+YYYY.MM.dd}" 
  }
}

</pre></li>

<li>jvm.options
修改 xms xmx 最大最小jvm 为256M 比es测试集群吃内存多</li>

<li>logstash.yml</li>
</ul></li>

<li>start logstash

<ul class="org-ul">
<li>bin/logstash -e 'input { stdin { } } output { stdout {} }'
测试启动</li>

<li><p>
./bin/logstash -f logstash-conf/beats.conf &amp;
</p>

<p>
配置文件启动
</p>

<p>
sudo netstat -anp | grep 5044
</p></li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgd29a6c6" class="outline-3">
<h3 id="orgd29a6c6"><span class="section-number-3">4.4</span> beats</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-orgbc6f0c3" class="outline-4">
<h4 id="orgbc6f0c3"><span class="section-number-4">4.4.1</span> topbeat</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
5.x版本后弃用了
</p>
<ol class="org-ol">
<li>下载
topbeat-1.3.1-x86<sub>64.tar.gz</sub></li>

<li>配置

<ul class="org-ul">
<li>topbeat</li>

<li>topbeat.template.json  
topbeat自带的模版，用来创建存放收集数据的索引结构</li>

<li><p>
topbeat.yml
</p>
<pre class="example">
input:
  period: 10           #默认10秒收集一次
  procs: [".*"]   #定义正则表达式，以匹配你所要监控的进程。默认是所有正在运行的进程都进行监控。
  stats:
    system: true
    proc: true
    filesystem: true
output:
  elasticsearch:
    hosts: ["master:9200"]
shipper:
logging:
  files:
</pre></li>
</ul></li>
</ol>


<ol class="org-ol">
<li>es导入模版
导入topbeat自带的模版，用来创建存放收集数据的索引结构

<ul class="org-ul">
<li><p>
Configuring Template Loading - supported for Elasticsearch output only
</p>
<pre class="example">
ERR Failed to perform any bulk index operations: 406 Not Acceptable
错误应该是模版和6.0版本不匹配了，官网没有更新
再去官网查看，topbeat 从5.0 已经被 Metricbeat替换了
</pre></li>

<li>Loading the Template Manually - required for Logstash output</li>
</ul></li>
</ol>


<ol class="org-ol">
<li>kibana</li>

<li><p>
启动topbeat节点
</p>

<p>
sudo ./topbeat -e -c topbeat.yml -d "publish"
</p></li>
</ol>
</div>
</div>
