note/note-linux-centos.org
*** filebeat
    1. download

       filebeat-6.1.1-linux-x86_64.tar.gz

       https://download.elastic.co/demos/logstash/gettingstarted/logstash-tutorial.log.gz
       logstash-tutorial.log.gz apache 的日志文件样本

    2. config
       
       - filebeat.yml
         #+BEGIN_SRC 
- type: log
  # Change to true to enable this prospector configuration.
  enabled: true
  # Paths that should be crawled and fetched. Glob based paths.
  paths:
    - /var/log/*.log
    - /home/manue1/opt/source/*.log
    #- c:\programdata\elasticsearch\logs\*


output.logstash:
  # The Logstash hosts
  hosts: ["master:5044"]

         
setup.kibana:

  host: "master:5601"         

         #+END_SRC
         
       - modules
         
         sudo chown -R root /home/manue1/opt/filebeat-6.1.1-linux-x86_64/module

         sudo chown -R root /home/manue1/opt/filebeat-6.1.1-linux-x86_64/modules.d
         
         - Enable modules when you run Filebeatedit

           sudo ./filebeat -e --modules system,nginx,mysql  
         
           ./filebeat -e --modules nginx -M "nginx.access.var.paths=[/var/log/nginx/access.log*]"
           
         - filebeat.yml

           sudo ./filebeat modules list

           sudo ./filebeat modules enable system 

           #+BEGIN_SRC 
默认配置读取所有enable
filebeat.modules:
- module: nginx
- module: mysql
- module: system
           
           #+END_SRC

           

         

       - setup template
         
         for logstash manually setup
         #+BEGIN_SRC 
./filebeat setup --template -E output.logstash.enabled=false -E 'output.elasticsearch.hosts=["localhost:9200"]'
         #+END_SRC

       - setup kibana dashboards

         #+BEGIN_SRC 
         ./filebeat setup --dashboards
         #+END_SRC

       - start filebeat

         sudo chown root filebeat.yml 

         sudo -s

         nohup /home/manue1/opt/filebeat-6.1.1-linux-x86_64/filebeat -e -c /home/manue1/opt/filebeat-6.1.1-linux-x86_64/filebeat.yml -d "publish" &

         ps aux |grep beat

*** metricbeat
    
    1. download
       
       metricbeat-6.1.1-linux-x86_64.tar.gz
       
    2. conf
       
       - metricbeat.yml
         
        1. 修改es和kibana的地址
           
           如果输出到logstash中，需要关闭直接写入es，并配置logstash监听5044端口
           es也要手动加载template
           #+BEGIN_SRC 
output.logstash:
  # The Logstash hosts
  hosts: ["master:5044"]
           #+END_SRC
        
        2. 配置template模版
           - Configure template loading
           - Load the template manually  
             required for Logstash output
             #+BEGIN_SRC 
             
             sudo ./metricbeat setup --template -E output.logstash.enabled=false -E 'output.elasticsearch.hosts=["master:9200"]'
             #+END_SRC

             
       - modules.d 
         目录下面可以配置多种模块
         修改 logstash.yml.disabled 为 logstash.yml 启动模块

       - kibana dashboard

         ./metricbeat setup --dashboards
         
    3. start 
       
       sudo chown root metricbeat.yml 
       sudo chown root modules.d/system.yml 
       sudo ./metricbeat -e -c metricbeat.yml -d "publish"

       ps aux |grep metricbeat


    复制到不同节点部署
*** packetbeat
    1. download 
       
       packetbeat-6.1.1-linux-x86_64.tar.gz

    2. config 
       
       - packetbeat.yml
         
         logstash & kibana 地址修改

       - setup template
         
         ./packetbeat setup --template -E output.logstash.enabled=false -E 'output.elasticsearch.hosts=["master:9200"]'

       - set up kibana dashboard

         ./packetbeat setup --dashboards

    3. start beat
       
       sudo chown root packetbeat.yml 

       nohup /home/manue1/opt/packetbeat-6.1.1-linux-x86_64/packetbeat -e -c  /home/manue1/opt/packetbeat-6.1.1-linux-x86_64/packetbeat.yml -d "publish" &
       
* hive 

hive只需要安装在集群任意一个节点上即可,这里安装在slave01上
  
** install mariadb

   安装hive前，需要mysql作为外置存储引擎，存放hive元数据(metastore)

   [[http://blog.csdn.net/Nemo____/article/details/72897455][参考安装]] mysql准备环境

   - remove mariadb
     : rpm -qa|grep mariadb         //查询出已安装的mariadb
     : rpm -e --nodeps 文件名        //卸载 ， 文件名为使用rpm -qa|grep mariadb 命令查出的所有文件
     : sudo  rpm -e --nodeps mariadb-libscc
         
   - install mariadb

    : yum install mariadb-server mariadb
    : systemctl start mariadb  #启动MariaDB
    : systemctl stop mariadb   #停止MariaDB
    : systemctl restart mariadb  #重启MariaDB
    : systemctl enable mariadb  #设置开机启动
    : mysql -uroot -p #NO PASSWORD
    : set password for 'root'@'localhost' =password('manue1');  # set new password
    : grant all privileges on *.* to root@'%'identified by 'manue1';  #远程连接设置

    vi /etc/my.cnf
    #+BEGIN_SRC 
    # set utf8
    [mysql]
    default-character-set=utf8  # NO SPACE
   #+END_SRC

