note/note-linux-centos.html
<div id="outline-container-orgf6de2b3" class="outline-4">
<h4 id="orgf6de2b3"><span class="section-number-4">4.4.2</span> filebeat</h4>
<div class="outline-text-4" id="text-4-4-2">
<ol class="org-ol">
<li><p>
download
</p>

<p>
filebeat-6.1.1-linux-x86<sub>64.tar.gz</sub>
</p>

<p>
<a href="https://download.elastic.co/demos/logstash/gettingstarted/logstash-tutorial.log.gz">https://download.elastic.co/demos/logstash/gettingstarted/logstash-tutorial.log.gz</a>
logstash-tutorial.log.gz apache 的日志文件样本
</p></li>

<li>config

<ul class="org-ul">
<li><p>
filebeat.yml
</p>
<pre class="example">
- type: log
  # Change to true to enable this prospector configuration.
  enabled: true
  # Paths that should be crawled and fetched. Glob based paths.
  paths:
    - /var/log/*.log
    - /home/manue1/opt/source/*.log
    #- c:\programdata\elasticsearch\logs\*


output.logstash:
  # The Logstash hosts
  hosts: ["master:5044"]


setup.kibana:

  host: "master:5601"         

</pre></li>

<li><p>
modules
</p>

<p>
sudo chown -R root /home/manue1/opt/filebeat-6.1.1-linux-x86<sub>64</sub>/module
</p>

<p>
sudo chown -R root /home/manue1/opt/filebeat-6.1.1-linux-x86<sub>64</sub>/modules.d
</p>

<ul class="org-ul">
<li><p>
Enable modules when you run Filebeatedit
</p>

<p>
sudo ./filebeat -e &#x2013;modules system,nginx,mysql  
</p>

<p>
./filebeat -e &#x2013;modules nginx -M "nginx.access.var.paths=[/var/log/nginx/access.log*]"
</p></li>

<li><p>
filebeat.yml
</p>

<p>
sudo ./filebeat modules list
</p>

<p>
sudo ./filebeat modules enable system 
</p>

<pre class="example">
默认配置读取所有enable
filebeat.modules:
- module: nginx
- module: mysql
- module: system

</pre></li>
</ul></li>
</ul></li>
</ol>





<ul class="org-ul">
<li><p>
setup template
</p>

<p>
for logstash manually setup
</p>
<pre class="example">
./filebeat setup --template -E output.logstash.enabled=false -E 'output.elasticsearch.hosts=["localhost:9200"]'
</pre></li>

<li><p>
setup kibana dashboards
</p>

<pre class="example">
./filebeat setup --dashboards
</pre></li>

<li><p>
start filebeat
</p>

<p>
sudo chown root filebeat.yml 
</p>

<p>
sudo -s
</p>

<p>
nohup /home/manue1/opt/filebeat-6.1.1-linux-x86<sub>64</sub>/filebeat -e -c /home/manue1/opt/filebeat-6.1.1-linux-x86<sub>64</sub>/filebeat.yml -d "publish" &amp;
</p>

<p>
ps aux |grep beat
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org5449b9f" class="outline-4">
<h4 id="org5449b9f"><span class="section-number-4">4.4.3</span> metricbeat</h4>
<div class="outline-text-4" id="text-4-4-3">
<ol class="org-ol">
<li><p>
download
</p>

<p>
metricbeat-6.1.1-linux-x86<sub>64.tar.gz</sub>
</p></li>

<li>conf

<ul class="org-ul">
<li>metricbeat.yml

<ol class="org-ol">
<li><p>
修改es和kibana的地址
</p>

<p>
如果输出到logstash中，需要关闭直接写入es，并配置logstash监听5044端口
es也要手动加载template
</p>
<pre class="example">
output.logstash:
  # The Logstash hosts
  hosts: ["master:5044"]
</pre></li>

<li>配置template模版
<ul class="org-ul">
<li>Configure template loading</li>
<li><p>
Load the template manually  
required for Logstash output
</p>
<pre class="example">

sudo ./metricbeat setup --template -E output.logstash.enabled=false -E 'output.elasticsearch.hosts=["master:9200"]'
</pre></li>
</ul></li>
</ol></li>
</ul></li>
</ol>


<ul class="org-ul">
<li>modules.d 
目录下面可以配置多种模块
修改 logstash.yml.disabled 为 logstash.yml 启动模块</li>

<li><p>
kibana dashboard
</p>

<p>
./metricbeat setup &#x2013;dashboards
</p></li>
</ul>
<ol class="org-ol">
<li><p>
start 
</p>

<p>
sudo chown root metricbeat.yml 
sudo chown root modules.d/system.yml 
sudo ./metricbeat -e -c metricbeat.yml -d "publish"
</p>

<p>
ps aux |grep metricbeat
</p></li>
</ol>


<p>
复制到不同节点部署
</p>
</div>
</div>
<div id="outline-container-org2a15685" class="outline-4">
<h4 id="org2a15685"><span class="section-number-4">4.4.4</span> packetbeat</h4>
<div class="outline-text-4" id="text-4-4-4">
<ol class="org-ol">
<li><p>
download 
</p>

<p>
packetbeat-6.1.1-linux-x86<sub>64.tar.gz</sub>
</p></li>

<li>config 

<ul class="org-ul">
<li><p>
packetbeat.yml
</p>

<p>
logstash &amp; kibana 地址修改
</p></li>

<li><p>
setup template
</p>

<p>
./packetbeat setup &#x2013;template -E output.logstash.enabled=false -E 'output.elasticsearch.hosts=["master:9200"]'
</p></li>

<li><p>
set up kibana dashboard
</p>

<p>
./packetbeat setup &#x2013;dashboards
</p></li>
</ul></li>

<li><p>
start beat
</p>

<p>
sudo chown root packetbeat.yml 
</p>

<p>
nohup /home/manue1/opt/packetbeat-6.1.1-linux-x86<sub>64</sub>/packetbeat -e -c  /home/manue1/opt/packetbeat-6.1.1-linux-x86<sub>64</sub>/packetbeat.yml -d "publish" &amp;
</p></li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-org1d8d55d" class="outline-2">
<h2 id="org1d8d55d"><span class="section-number-2">5</span> hive</h2>
<div class="outline-text-2" id="text-5">
<p>
hive只需要安装在集群任意一个节点上即可,这里安装在slave01上
</p>
</div>

<div id="outline-container-orga0a9e33" class="outline-3">
<h3 id="orga0a9e33"><span class="section-number-3">5.1</span> install mariadb</h3>
<div class="outline-text-3" id="text-5-1">
<p>
安装hive前，需要mysql作为外置存储引擎，存放hive元数据(metastore)
</p>

<p>
<a href="http://blog.csdn.net/Nemo____/article/details/72897455">参考安装</a> mysql准备环境
</p>

<ul class="org-ul">
<li><p>
remove mariadb
</p>
<pre class="example">
rpm -qa|grep mariadb         //查询出已安装的mariadb
rpm -e --nodeps 文件名        //卸载 ， 文件名为使用rpm -qa|grep mariadb 命令查出的所有文件
sudo  rpm -e --nodeps mariadb-libscc

</pre></li>

<li><p>
install mariadb
</p>

<pre class="example">
yum install mariadb-server mariadb
systemctl start mariadb  #启动MariaDB
systemctl stop mariadb   #停止MariaDB
systemctl restart mariadb  #重启MariaDB
systemctl enable mariadb  #设置开机启动
mysql -uroot -p #NO PASSWORD
set password for 'root'@'localhost' =password('manue1');  # set new password
grant all privileges on *.* to root@'%'identified by 'manue1';  #远程连接设置

</pre>

<p>
vi /etc/my.cnf
</p>
<pre class="example">
# set utf8
[mysql]
default-character-set=utf8  # NO SPACE
</pre></li>
</ul>
</div>
</div>
