note/note-linux-centos.org
** config hive

 配置安装[[http://mirrors.shuosc.org/apache/hive/stable-2/][hive]] 参考： [[https://cwiki.apache.org/confluence/display/Hive/GettingStarted][1]]  [[http://blog.csdn.net/jssg_tzw/article/details/72354470][2]]

- *.bashrc*

 hive 环境变量配置

 : export HIVE_HOME=/home/manue1/opt/apache-hive-2.3.2-bin
 : export PATH=$PATH:$HIVE_HOME/bin

- *metastore conf*

 hive元数据存放mysql,为hive建立相应的mysql账户,并赋予足够的权限
     
 : mysql -h slave01 -uroot -p
 : insert into mysql.user (Host,User,Password)values('localhost','hive',password('manue1'));
 : create database hive;
 : grant all privileges on hive.* to hive@'%'identified by 'manue1'; 
 : flush privileges; 

- *配置hive-env.sh 文件*

   mv hive-env.sh.template hive-env.sh
  
  : export HADOOP_HOME=/home/manue1/opt/hadoop-2.7.5
  : export HIVE_CONF_DIR=/home/manue1/opt/apache-hive-2.3.2-bin/conf
  : export HIVE_AUX_JARS_PATH=/home/manue1/opt/apache-hive-2.3.2-bin/lib

- *hive-site.xml*
      
 : mv hive-default.xml hive-site.xml
      
 1. hdfs新建hive数据目录

    因为在hive-site.xml配置了hive表的数据存放在hdfs上的/user/hive/warehouse内,
   
    : <name>hive.metastore.warehouse.dir</name>
    : <value>/user/hive/warehouse</value>
    : <name>hive.exec.scratchdir</name>
    : <value>/tmp/hive</value>
   
    所以要在Hadoop集群新建目录，执行命令
   
    : [manue1@master conf]$ hadoop fs -mkdir -p /user/hive/warehouse
    : [manue1@master conf]$ hadoop fs -chmod -R 777 /user/hive/warehouse
    : [manue1@master conf]$ hadoop fs -mkdir -p /tmp/hive
    : [manue1@master conf]$ hadoop fs -chmod -R 777 /tmp/hive

 2. hive-site.xml内mysql相关配置

    需要java连接mysql的依赖包下载[[https://dev.mysql.com/downloads/connector/j/5.1.html][mysql-connector-java-5.1.45-bin.jar]] 
   
    : mv mysql-connector-java-5.1.45-bin.jar lib/
   
   #+BEGIN_SRC 
    1. javax.jdo.option.ConnectionDriverName，将该name对应的value修改为MySQL驱动类路径：
    <property
      <name>javax.jdo.option.ConnectionDriverName</name>
      <value>com.mysql.jdbc.Driver</value>
    </property>  
   
    2. javax.jdo.option.ConnectionURL，将该name对应的value修改为MySQL的地址：
     <name>javax.jdo.option.ConnectionURL</name>
     <value>jdbc:mysql://192.168.56.11:3306/hive?createDatabaseIfNotExist=true</value>
   
    3.javax.jdo.option.ConnectionUserName，将对应的value修改为MySQL数据库登录名：
    <name>javax.jdo.option.ConnectionUserName</name>
    <value>hive</value>
   
    4.javax.jdo.option.ConnectionPassword，将对应的value修改为MySQL数据库的登录密码：
    <name>javax.jdo.option.ConnectionPassword</name>
    <value>*******</value>
   
   #+END_SRC

 3. 替换${system 等值
         
    ${system:user.name}都替换为manue1
    
    ${system:java.io.tmpdir}替换为hive的临时目录 /home/manue1/opt/apache-hive-2.3.2-bin/iotmp,先创建，再替换

    : [manue1@master apache-hive-2.3.2-bin]$ mkdir iotmp
    : [manue1@master apache-hive-2.3.2-bin]$ sudo chmod -R 777 iotmp
    
    : :%s/${system:java.io.tmpdir}/\/home\/manue1\/opt\/apache-hive-2.3.2-bin\/iotmp/gg
    : :%s/${system:user.name}/manue1/gg

最后初始化metadata表数据

: schematool -initSchema -dbType mysql

** start hive

Hive的三种启动方式

1. hive  命令行模式

   进入hive安装目录，输入bin/hive的执行程序，或者输入 hive --service cli

   用于linux平台命令行查询，查询语句基本跟mysql查询语句类似

2. hive  web界面的启动方式

   bin/hive --service hwi 

   用于通过浏览器来访问hive，感觉没多大用途，浏览器访问地址是：127.0.0.1:9999/hwi

3. hive  远程服务 (端口号10000) 启动方式

   bin/hive --service hiveserver2 &

   用java，python等程序实现通过jdbc等驱动的访问hive就用这种起动方式了，这个是程序员最需要的方式了


   此时可以使用beeline 测试jdbc连接

   : beeline -u jdbc:hive2://slave01:10000 -n manue1 -p mmanue1


问题一:
#+BEGIN_SRC 

Connecting to jdbc:hive2://master:10000/default
18/01/10 20:37:17 [main]: WARN jdbc.HiveConnection: Failed to connect to master:10000
Error: Could not open client transport with JDBC Uri: jdbc:hive2://master:10000/default: Failed to open new session: java.lang.RuntimeException: org.apache.hadoop.ipc.RemoteException(org.apache.hadoop.security.authorize.AuthorizationException): User: manue1 is not allowed to impersonate anonymous (state=08S01,code=0)
Beeline version 2.3.2 by Apache Hive
beeline> 

分析 ： 访问权限问题

解决 ：在hdfs 的配置文件core-site.xml中加入如下配置，root为位置填入  User:*  ，etc   hadoop.proxyuser.eamon.hosts

 <property>
   <name>hadoop.proxyuser.manue1.hosts</name>
   <value>*</value>
 </property>
 <property>
  <name>hadoop.proxyuser.manue1.groups</name>
  <value>*</value>
</property>
#+END_SRC

问题二:
#+BEGIN_SRC 
ERROR 1045 (28000): Access denied for user 'hive'@'slave01' (using password: YES)

查看mysql.user表已经存在hive@%，但依然不能访问slave01,最终无解只能添加下面一条

grant all privileges on hive.* to hive@'%'identified by 'manue1';
flush privileges; 

#+END_SRC
* sqoop

 1. 环境配置

    从[[https://sqoop.apache.org][官网下载]] 解压安装，配置SQOOP_HOME目录
    #+BEGIN_SRC 
export SQOOP_HOME=/home/manue1/opt/sqoop-1.4.7.bin__hadoop-2.6.0
export PATH=$SQOOP_HOME/bin:$PATH
    #+END_SRC
    拷贝${SQOOP_HOME}/conf/sqoop-env-template.sh  
    到${SQOOP_HOME}/conf/sqoop-env.sh，
    然后修改sqoop-env.sh
    #+BEGIN_SRC 
export HADOOP_COMMON_HOME=/home/manue1/opt/hadoop-2.7.5
export HADOOP_MAPRED_HOME=/home/manue1/opt/hadoop-2.7.5
export HIVE_HOME=/home/manue1/opt/apache-hive-2.3.2-bin
    #+END_SRC

 2. 测试连接mysql
    
    将连接mysql的jar导入sqoop/lib内
    
    : sqoop list-databases --connect jdbc:mysql://slave01:3306/hive --username root --password manue1
* zookeeper
** Replicated ZooKeeper configural
   #+BEGIN_SRC 
note

For replicated mode, a minimum of three servers are required, and it is strongly recommended that you have an odd number of servers. If you only have two servers, then you are in a situation where if one of them fails, there are not enough machines to form a majority quorum. Two servers is inherently less stable than a single server, because there are two single points of failure.
     
  至少3节点,每个zookeeper服务都可以成为leader， follower，observer。
     #+END_SRC
   
   - vi conf/zoo.cfg

     sudo mkdir -p /var/lib/zookeeper
     sudo chown manue1:manue1  /var/lib/zookeeper/ #manue1 user start service
     创建 vi /var/lib/zookeeper/myid 内容为node server.x ,如 master为1
     
     #+BEGIN_SRC 

tickTime=2000
dataDir=/var/lib/zookeeper
clientPort=2181
initLimit=5
syncLimit=2
server.1=master:2888:3888   #2888 集群互相通信 3888 leader选举
server.2=slave01:2888:3888
server.3=slave02:2888:3888

# ，端口 2181 由 ZooKeeper 客户端使用，用于连接到 ZooKeeper 服务器；端口 2888 由对等 ZooKeeper 服务器使用，用于互相通信；而端口 3888 用于领导者选举

     #+END_SRC
     scp -r zookeeper-3.4.10 manue1@slave01:/home/manue1/opt
     scp -r zookeeper-3.4.10 manue1@slave02:/home/manue1/opt

   - start service
     
     nohup /home/manue1/opt/zookeeper-3.4.10/bin/zkServer.sh restart

     ps -ef | grep zookeeper

     netstat -tnlpa | grep 2181 

     echo state | nc localhost 2181
* hbase
  start hadoop & zookeeper
