note/note-linux-centos.html

<div id="outline-container-org81c53db" class="outline-3">
<h3 id="org81c53db"><span class="section-number-3">5.2</span> config hive</h3>
<div class="outline-text-3" id="text-5-2">
<p>
配置安装<a href="http://mirrors.shuosc.org/apache/hive/stable-2/">hive</a> 参考： <a href="https://cwiki.apache.org/confluence/display/Hive/GettingStarted">1</a>  <a href="http://blog.csdn.net/jssg_tzw/article/details/72354470">2</a>
</p>

<ul class="org-ul">
<li><p>
<b>.bashrc</b>
</p>

<p>
hive 环境变量配置
</p>

<pre class="example">
export HIVE_HOME=/home/manue1/opt/apache-hive-2.3.2-bin
export PATH=$PATH:$HIVE_HOME/bin

</pre></li>

<li><p>
<b>metastore conf</b>
</p>

<p>
hive元数据存放mysql,为hive建立相应的mysql账户,并赋予足够的权限
</p>

<pre class="example">
mysql -h slave01 -uroot -p
insert into mysql.user (Host,User,Password)values('localhost','hive',password('manue1'));
create database hive;
grant all privileges on hive.* to hive@'%'identified by 'manue1'; 
flush privileges; 

</pre></li>

<li><p>
<b>配置hive-env.sh 文件</b>
</p>

<p>
mv hive-env.sh.template hive-env.sh
</p>

<pre class="example">
export HADOOP_HOME=/home/manue1/opt/hadoop-2.7.5
export HIVE_CONF_DIR=/home/manue1/opt/apache-hive-2.3.2-bin/conf
export HIVE_AUX_JARS_PATH=/home/manue1/opt/apache-hive-2.3.2-bin/lib

</pre></li>

<li><p>
<b>hive-site.xml</b>
</p>

<pre class="example">
mv hive-default.xml hive-site.xml

</pre>

<ol class="org-ol">
<li><p>
hdfs新建hive数据目录
</p>

<p>
因为在hive-site.xml配置了hive表的数据存放在hdfs上的/user/hive/warehouse内,
</p>

<pre class="example">
&lt;name&gt;hive.metastore.warehouse.dir&lt;/name&gt;
&lt;value&gt;/user/hive/warehouse&lt;/value&gt;
&lt;name&gt;hive.exec.scratchdir&lt;/name&gt;
&lt;value&gt;/tmp/hive&lt;/value&gt;

</pre>

<p>
所以要在Hadoop集群新建目录，执行命令
</p>

<pre class="example">
[manue1@master conf]$ hadoop fs -mkdir -p /user/hive/warehouse
[manue1@master conf]$ hadoop fs -chmod -R 777 /user/hive/warehouse
[manue1@master conf]$ hadoop fs -mkdir -p /tmp/hive
[manue1@master conf]$ hadoop fs -chmod -R 777 /tmp/hive

</pre></li>

<li><p>
hive-site.xml内mysql相关配置
</p>

<p>
需要java连接mysql的依赖包下载<a href="https://dev.mysql.com/downloads/connector/j/5.1.html">mysql-connector-java-5.1.45-bin.jar</a> 
</p>

<pre class="example">
mv mysql-connector-java-5.1.45-bin.jar lib/

</pre>

<pre class="example">
1. javax.jdo.option.ConnectionDriverName，将该name对应的value修改为MySQL驱动类路径：
&lt;property
  &lt;name&gt;javax.jdo.option.ConnectionDriverName&lt;/name&gt;
  &lt;value&gt;com.mysql.jdbc.Driver&lt;/value&gt;
&lt;/property&gt;  

2. javax.jdo.option.ConnectionURL，将该name对应的value修改为MySQL的地址：
 &lt;name&gt;javax.jdo.option.ConnectionURL&lt;/name&gt;
 &lt;value&gt;jdbc:mysql://192.168.56.11:3306/hive?createDatabaseIfNotExist=true&lt;/value&gt;

3.javax.jdo.option.ConnectionUserName，将对应的value修改为MySQL数据库登录名：
&lt;name&gt;javax.jdo.option.ConnectionUserName&lt;/name&gt;
&lt;value&gt;hive&lt;/value&gt;

4.javax.jdo.option.ConnectionPassword，将对应的value修改为MySQL数据库的登录密码：
&lt;name&gt;javax.jdo.option.ConnectionPassword&lt;/name&gt;
&lt;value&gt;*******&lt;/value&gt;

</pre></li>

<li><p>
替换${system 等值
</p>

<p>
${system:user.name}都替换为manue1
</p>

<p>
${system:java.io.tmpdir}替换为hive的临时目录 /home/manue1/opt/apache-hive-2.3.2-bin/iotmp,先创建，再替换
</p>

<pre class="example">
[manue1@master apache-hive-2.3.2-bin]$ mkdir iotmp
[manue1@master apache-hive-2.3.2-bin]$ sudo chmod -R 777 iotmp

</pre>

<pre class="example">
:%s/${system:java.io.tmpdir}/\/home\/manue1\/opt\/apache-hive-2.3.2-bin\/iotmp/gg
:%s/${system:user.name}/manue1/gg

</pre></li>
</ol></li>
</ul>

<p>
最后初始化metadata表数据
</p>

<pre class="example">
schematool -initSchema -dbType mysql

</pre>
</div>
</div>

<div id="outline-container-orgd8a5063" class="outline-3">
<h3 id="orgd8a5063"><span class="section-number-3">5.3</span> start hive</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Hive的三种启动方式
</p>

<ol class="org-ol">
<li><p>
hive  命令行模式
</p>

<p>
进入hive安装目录，输入bin/hive的执行程序，或者输入 hive &#x2013;service cli
</p>

<p>
用于linux平台命令行查询，查询语句基本跟mysql查询语句类似
</p></li>

<li><p>
hive  web界面的启动方式
</p>

<p>
bin/hive &#x2013;service hwi 
</p>

<p>
用于通过浏览器来访问hive，感觉没多大用途，浏览器访问地址是：127.0.0.1:9999/hwi
</p></li>

<li><p>
hive  远程服务 (端口号10000) 启动方式
</p>

<p>
bin/hive &#x2013;service hiveserver2 &amp;
</p>

<p>
用java，python等程序实现通过jdbc等驱动的访问hive就用这种起动方式了，这个是程序员最需要的方式了
</p></li>
</ol>


<p>
此时可以使用beeline 测试jdbc连接
</p>

<pre class="example">
beeline -u jdbc:hive2://slave01:10000 -n manue1 -p mmanue1

</pre>


<p>
问题一:
</p>
<pre class="example">

Connecting to jdbc:hive2://master:10000/default
18/01/10 20:37:17 [main]: WARN jdbc.HiveConnection: Failed to connect to master:10000
Error: Could not open client transport with JDBC Uri: jdbc:hive2://master:10000/default: Failed to open new session: java.lang.RuntimeException: org.apache.hadoop.ipc.RemoteException(org.apache.hadoop.security.authorize.AuthorizationException): User: manue1 is not allowed to impersonate anonymous (state=08S01,code=0)
Beeline version 2.3.2 by Apache Hive
beeline&gt; 

分析 ： 访问权限问题

解决 ：在hdfs 的配置文件core-site.xml中加入如下配置，root为位置填入  User:*  ，etc   hadoop.proxyuser.eamon.hosts

 &lt;property&gt;
   &lt;name&gt;hadoop.proxyuser.manue1.hosts&lt;/name&gt;
   &lt;value&gt;*&lt;/value&gt;
 &lt;/property&gt;
 &lt;property&gt;
  &lt;name&gt;hadoop.proxyuser.manue1.groups&lt;/name&gt;
  &lt;value&gt;*&lt;/value&gt;
&lt;/property&gt;
</pre>

<p>
问题二:
</p>
<pre class="example">
ERROR 1045 (28000): Access denied for user 'hive'@'slave01' (using password: YES)

查看mysql.user表已经存在hive@%，但依然不能访问slave01,最终无解只能添加下面一条

grant all privileges on hive.* to hive@'%'identified by 'manue1';
flush privileges; 

</pre>
</div>
</div>
</div>
<div id="outline-container-orgefc5e17" class="outline-2">
<h2 id="orgefc5e17"><span class="section-number-2">6</span> sqoop</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li><p>
环境配置
</p>

<p>
从<a href="https://sqoop.apache.org">官网下载</a> 解压安装，配置SQOOP<sub>HOME目录</sub>
</p>
<pre class="example">
export SQOOP_HOME=/home/manue1/opt/sqoop-1.4.7.bin__hadoop-2.6.0
export PATH=$SQOOP_HOME/bin:$PATH
</pre>
<p>
拷贝\({SQOOP_HOME}/conf/sqoop-env-template.sh  
    到\){SQOOP<sub>HOME</sub>}/conf/sqoop-env.sh，
然后修改sqoop-env.sh
</p>
<pre class="example">
export HADOOP_COMMON_HOME=/home/manue1/opt/hadoop-2.7.5
export HADOOP_MAPRED_HOME=/home/manue1/opt/hadoop-2.7.5
export HIVE_HOME=/home/manue1/opt/apache-hive-2.3.2-bin
</pre></li>

<li><p>
测试连接mysql
</p>

<p>
将连接mysql的jar导入sqoop/lib内
</p>

<pre class="example">
sqoop list-databases --connect jdbc:mysql://slave01:3306/hive --username root --password manue1

</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org92e5865" class="outline-2">
<h2 id="org92e5865"><span class="section-number-2">7</span> zookeeper</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgdffecae" class="outline-3">
<h3 id="orgdffecae"><span class="section-number-3">7.1</span> Replicated ZooKeeper configural</h3>
<div class="outline-text-3" id="text-7-1">
<pre class="example">
note

For replicated mode, a minimum of three servers are required, and it is strongly recommended that you have an odd number of servers. If you only have two servers, then you are in a situation where if one of them fails, there are not enough machines to form a majority quorum. Two servers is inherently less stable than a single server, because there are two single points of failure.

  至少3节点,每个zookeeper服务都可以成为leader， follower，observer。
</pre>

<ul class="org-ul">
<li><p>
vi conf/zoo.cfg
</p>

<p>
sudo mkdir -p <i>var/lib/zookeeper
sudo chown manue1:manue1  /var/lib/zookeeper</i> #manue1 user start service
创建 vi /var/lib/zookeeper/myid 内容为node server.x ,如 master为1
</p>

<pre class="example">

tickTime=2000
dataDir=/var/lib/zookeeper
clientPort=2181
initLimit=5
syncLimit=2
server.1=master:2888:3888   #2888 集群互相通信 3888 leader选举
server.2=slave01:2888:3888
server.3=slave02:2888:3888

# ，端口 2181 由 ZooKeeper 客户端使用，用于连接到 ZooKeeper 服务器；端口 2888 由对等 ZooKeeper 服务器使用，用于互相通信；而端口 3888 用于领导者选举

</pre>
<p>
scp -r zookeeper-3.4.10 manue1@slave01:/home/manue1/opt
scp -r zookeeper-3.4.10 manue1@slave02:/home/manue1/opt
</p></li>

<li><p>
start service
</p>

<p>
nohup /home/manue1/opt/zookeeper-3.4.10/bin/zkServer.sh restart
</p>

<p>
ps -ef | grep zookeeper
</p>

<p>
netstat -tnlpa | grep 2181 
</p>

<p>
echo state | nc localhost 2181
</p></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org67b0d04" class="outline-2">
<h2 id="org67b0d04"><span class="section-number-2">8</span> hbase</h2>
<div class="outline-text-2" id="text-8">
<p>
start hadoop &amp; zookeeper
</p>
</div>
