note/note-linux-centos.org
** hbase configural
   - .bashrc

     #+BEGIN_SRC 
# Hbase Environment Variables
export HBASE_HOME=/home/manue1/opt/hbase-1.2.6/
PATH=$JAVA_HOME/bin:$HADOOP_HOME/bin:$HBASE_HOME/bin:$PATH


     
     #+END_SRC
     
   - hbase-env.sh
     #+BEGIN_SRC 
export JAVA_HOME=/home/manue1/opt/jdk8
export HBASE_MANAGES_ZK=false
     
     #+END_SRC

   - hbase-site.xml
     
   - regionservers
     #+BEGIN_SRC 
master
slave01
slave02
     #+END_SRC

     
** hbase start

 nohup /home/manue1/opt/hbase-1.2.6/bin/start-hbase.sh &

 nohup /home/manue1/opt/hbase-1.2.6/bin/stop-hbase.sh &


 http://master:16010/master-status
* kafka
** kafka configural
   
   - conf/server.properties

     #+BEGIN_SRC 
#指定zookeeper的连接信息
zookeeper.connect=master:2181,slave01:2181,slave02:2181

#每个broker相当于一个节点，注意各个节点的broker.id的值必须唯一
broker.id=0

#broker监听端口
listeners=PLAINTEXT://master:9092

log.dir=/var/log/kafka
     #+END_SRC
      sudo mkdir -p /var/log/kafka  
      sudo chown manue1:manue1 /var/log/kafka

     scp -r kafka_2.11-1.0.0/ manue1@slave01:/home/manue1/opt
     scp -r kafka_2.11-1.0.0/ manue1@slave02:/home/manue1/opt
     各个节点修改broker.id 和 listeners

** kafka start service


   - vi .bashrc
     #+BEGIN_SRC 
# KAFKA_HOME Environment Variables
export KAFKA_HOME=/home/manue1/opt/kafka_2.11-1.0.0
export PATH=$PATH:$KAFKA_HOME/bin
     
     #+END_SRC


   nohup  $KAFKA_HOME/bin/kafka-server-start.sh $KAFKA_HOME/config/server.properties &

   $KAFKA_HOME/bin/kafka-server-stop.sh
   #+BEGIN_SRC 

   虚拟机环境内存不够，配置启动脚本 jvm heap 大小 

[manue1@slave01 config]$ $KAFKA_HOME/bin/kafka-server-start.sh $KAFKA_HOME/config/server.propertie
Java HotSpot(TM) 64-Bit Server VM warning: INFO: os::commit_memory(0x00000000c0000000, 1073741824, 0) failed; error='Cannot allocate memory' (errno=12)
   

vi kafka-server-start.sh

KAFKA_HEAP_OPTS="-Xmx256M -Xms128M
   #+END_SRC

   sudo netstat -anp | grep 9092
** use kafka

   http://blog.csdn.net/u010297957/article/details/72758765
   
   producer & consumer
   #+BEGIN_SRC 

[manue1@master ~]$ $KAFKA_HOME/bin/kafka-topics.sh --create --topic TestTopic001 --partitions 2 --replication-factor 1 --zookeeper master:2181,slave01:2181,slave02:2181
Created topic "TestTopic001".

[manue1@master ~]$ $KAFKA_HOME/bin/kafka-topics.sh --describe --topic TestTopic001 --zookeeper master:2181,slave01:2181,slave02:2181
Topic:TestTopic001	PartitionCount:2	ReplicationFactor:1	Configs:
	Topic: TestTopic001	Partition: 0	Leader: 1	Replicas: 1	Isr: 1
	Topic: TestTopic001	Partition: 1	Leader: 2	Replicas: 2	Isr: 2

[manue1@master logs]$ $KAFKA_HOME/bin/kafka-console-producer.sh --broker-list master:9092,slave01:9092,slave02:9092 --topic TestTopic001
>hi zbr
>what is your name
>i love zbr


[manue1@slave01 kafka_2.11-1.0.0]$ $KAFKA_HOME/bin/kafka-console-consumer.sh --from-beginning --topic TestTopic001 --zookeeper master:2181,slave01:2181,slave02:2181
Using the ConsoleConsumer with old consumer is deprecated and will be removed in a future major release. Consider using the new consumer by passing [bootstrap-server] instead of [zookeeper].
hi zbr
what is your name
i love zbr
   
   #+END_SRC
* spark
** spark configural

  https://data-flair.training/blogs/install-apache-spark-multi-node-cluster/


  - .bashrc
    #+BEGIN_SRC 
#SPARK_HOME Environment Variables
export SPARK_HOME=/home/manue1/opt/spark-2.2.1-bin-hadoop2.7
export PATH=$PATH:$SPARK_HOME/bin
    #+END_SRC

  - spark-env.sh
    
    cp spark-env.sh.template spark-env.sh

    #+BEGIN_SRC 
export JAVA_HOME=/home/manue1/opt/jdk8

export SCALA_HOME=/home/manue1/opt/scala-2.11.7

export HADOOP_HOME=/home/manue1/opt/hadoop-2.7.5

export HADOOP_CONF_DIR=/home/manue1/opt/hadoop-2.7.5/etc/hadoop

export SPARK_MASTER_IP=master

export SPARK_WORKER_MEMORY=64m

export SPARK_WORKER_CORES=1

export SPARK_WORKER_INSTANCES=2

变量说明
JAVA_HOME：Java安装目录
SCALA_HOME：Scala安装目录
HADOOP_HOME：hadoop安装目录
HADOOP_CONF_DIR：hadoop集群的配置文件的目录
SPARK_MASTER_IP：spark集群的Master节点的ip地址
SPARK_WORKER_MEMORY：每个worker节点能够最大分配给exectors的内存大小
SPARK_WORKER_CORES：每个worker节点所占有的CPU核数目
SPARK_WORKER_INSTANCES：每台机器上开启的worker节点的数目
    
    #+END_SRC

  - slaves
    #+BEGIN_SRC 
master
slave01
slave02
    #+END_SRC


  slave sync

  scp -r spark-2.2.1-bin-hadoop2.7/ manue1@192.168.1.109:/home/manue1/opt
** spark start

   nohup sh /home/manue1/opt/hadoop-2.7.5/sbin/start-all.sh &  #启动hdfs即可

   $SPARK_HOME/sbin/start-all.sh


   WebUI
   http://master:8080/

   spark-shell.sh 运行后可以访问后台执行的任务
   http://master:4040/

   spark-submit yarn 管理方式
   http://master:8088/
   
