note/note-linux-centos.html
<div id="outline-container-org80aab88" class="outline-3">
<h3 id="org80aab88"><span class="section-number-3">8.1</span> hbase configural</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li><p>
.bashrc
</p>

<pre class="example">
# Hbase Environment Variables
export HBASE_HOME=/home/manue1/opt/hbase-1.2.6/
PATH=$JAVA_HOME/bin:$HADOOP_HOME/bin:$HBASE_HOME/bin:$PATH



</pre></li>

<li><p>
hbase-env.sh
</p>
<pre class="example">
export JAVA_HOME=/home/manue1/opt/jdk8
export HBASE_MANAGES_ZK=false

</pre></li>

<li>hbase-site.xml</li>

<li><p>
regionservers
</p>
<pre class="example">
master
slave01
slave02
</pre></li>
</ul>
</div>
</div>


<div id="outline-container-org6af7569" class="outline-3">
<h3 id="org6af7569"><span class="section-number-3">8.2</span> hbase start</h3>
<div class="outline-text-3" id="text-8-2">
<p>
nohup /home/manue1/opt/hbase-1.2.6/bin/start-hbase.sh &amp;
</p>

<p>
nohup /home/manue1/opt/hbase-1.2.6/bin/stop-hbase.sh &amp;
</p>


<p>
<a href="http://master:16010/master-status">http://master:16010/master-status</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org3406069" class="outline-2">
<h2 id="org3406069"><span class="section-number-2">9</span> kafka</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgb7be641" class="outline-3">
<h3 id="orgb7be641"><span class="section-number-3">9.1</span> kafka configural</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li><p>
conf/server.properties
</p>

<pre class="example">
#指定zookeeper的连接信息
zookeeper.connect=master:2181,slave01:2181,slave02:2181

#每个broker相当于一个节点，注意各个节点的broker.id的值必须唯一
broker.id=0

#broker监听端口
listeners=PLAINTEXT://master:9092

log.dir=/var/log/kafka
</pre>
<p>
sudo mkdir -p /var/log/kafka  
sudo chown manue1:manue1 /var/log/kafka
</p>

<p>
scp -r kafka<sub>2.11</sub>-1.0.0/ manue1@slave01:/home/manue1/opt
scp -r kafka<sub>2.11</sub>-1.0.0/ manue1@slave02:/home/manue1/opt
各个节点修改broker.id 和 listeners
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orga80f540" class="outline-3">
<h3 id="orga80f540"><span class="section-number-3">9.2</span> kafka start service</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li><p>
vi .bashrc
</p>
<pre class="example">
# KAFKA_HOME Environment Variables
export KAFKA_HOME=/home/manue1/opt/kafka_2.11-1.0.0
export PATH=$PATH:$KAFKA_HOME/bin

</pre></li>
</ul>


<p>
nohup  $KAFKA<sub>HOME</sub>/bin/kafka-server-start.sh $KAFKA<sub>HOME</sub>/config/server.properties &amp;
</p>

<p>
$KAFKA<sub>HOME</sub>/bin/kafka-server-stop.sh
</p>
<pre class="example">

   虚拟机环境内存不够，配置启动脚本 jvm heap 大小 

[manue1@slave01 config]$ $KAFKA_HOME/bin/kafka-server-start.sh $KAFKA_HOME/config/server.propertie
Java HotSpot(TM) 64-Bit Server VM warning: INFO: os::commit_memory(0x00000000c0000000, 1073741824, 0) failed; error='Cannot allocate memory' (errno=12)


vi kafka-server-start.sh

KAFKA_HEAP_OPTS="-Xmx256M -Xms128M
</pre>

<p>
sudo netstat -anp | grep 9092
</p>
</div>
</div>
<div id="outline-container-orgfafc201" class="outline-3">
<h3 id="orgfafc201"><span class="section-number-3">9.3</span> use kafka</h3>
<div class="outline-text-3" id="text-9-3">
<p>
<a href="http://blog.csdn.net/u010297957/article/details/72758765">http://blog.csdn.net/u010297957/article/details/72758765</a>
</p>

<p>
producer &amp; consumer
</p>
<pre class="example">

[manue1@master ~]$ $KAFKA_HOME/bin/kafka-topics.sh --create --topic TestTopic001 --partitions 2 --replication-factor 1 --zookeeper master:2181,slave01:2181,slave02:2181
Created topic "TestTopic001".

[manue1@master ~]$ $KAFKA_HOME/bin/kafka-topics.sh --describe --topic TestTopic001 --zookeeper master:2181,slave01:2181,slave02:2181
Topic:TestTopic001	PartitionCount:2	ReplicationFactor:1	Configs:
    Topic: TestTopic001	Partition: 0	Leader: 1	Replicas: 1	Isr: 1
    Topic: TestTopic001	Partition: 1	Leader: 2	Replicas: 2	Isr: 2

[manue1@master logs]$ $KAFKA_HOME/bin/kafka-console-producer.sh --broker-list master:9092,slave01:9092,slave02:9092 --topic TestTopic001
&gt;hi zbr
&gt;what is your name
&gt;i love zbr


[manue1@slave01 kafka_2.11-1.0.0]$ $KAFKA_HOME/bin/kafka-console-consumer.sh --from-beginning --topic TestTopic001 --zookeeper master:2181,slave01:2181,slave02:2181
Using the ConsoleConsumer with old consumer is deprecated and will be removed in a future major release. Consider using the new consumer by passing [bootstrap-server] instead of [zookeeper].
hi zbr
what is your name
i love zbr

</pre>
</div>
</div>
</div>
<div id="outline-container-org0076e18" class="outline-2">
<h2 id="org0076e18"><span class="section-number-2">10</span> spark</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org4fd5fec" class="outline-3">
<h3 id="org4fd5fec"><span class="section-number-3">10.1</span> spark configural</h3>
<div class="outline-text-3" id="text-10-1">
<p>
<a href="https://data-flair.training/blogs/install-apache-spark-multi-node-cluster/">https://data-flair.training/blogs/install-apache-spark-multi-node-cluster/</a>
</p>


<ul class="org-ul">
<li><p>
.bashrc
</p>
<pre class="example">
#SPARK_HOME Environment Variables
export SPARK_HOME=/home/manue1/opt/spark-2.2.1-bin-hadoop2.7
export PATH=$PATH:$SPARK_HOME/bin
</pre></li>

<li><p>
spark-env.sh
</p>

<p>
cp spark-env.sh.template spark-env.sh
</p>

<pre class="example">
export JAVA_HOME=/home/manue1/opt/jdk8

export SCALA_HOME=/home/manue1/opt/scala-2.11.7

export HADOOP_HOME=/home/manue1/opt/hadoop-2.7.5

export HADOOP_CONF_DIR=/home/manue1/opt/hadoop-2.7.5/etc/hadoop

export SPARK_MASTER_IP=master

export SPARK_WORKER_MEMORY=64m

export SPARK_WORKER_CORES=1

export SPARK_WORKER_INSTANCES=2

变量说明
JAVA_HOME：Java安装目录
SCALA_HOME：Scala安装目录
HADOOP_HOME：hadoop安装目录
HADOOP_CONF_DIR：hadoop集群的配置文件的目录
SPARK_MASTER_IP：spark集群的Master节点的ip地址
SPARK_WORKER_MEMORY：每个worker节点能够最大分配给exectors的内存大小
SPARK_WORKER_CORES：每个worker节点所占有的CPU核数目
SPARK_WORKER_INSTANCES：每台机器上开启的worker节点的数目

</pre></li>

<li><p>
slaves
</p>
<pre class="example">
master
slave01
slave02
</pre></li>
</ul>


<p>
slave sync
</p>

<p>
scp -r spark-2.2.1-bin-hadoop2.7/ manue1@192.168.1.109:/home/manue1/opt
</p>
</div>
</div>
<div id="outline-container-orgf5bd40a" class="outline-3">
<h3 id="orgf5bd40a"><span class="section-number-3">10.2</span> spark start</h3>
<div class="outline-text-3" id="text-10-2">
<p>
nohup sh /home/manue1/opt/hadoop-2.7.5/sbin/start-all.sh &amp;  #启动hdfs即可
</p>

<p>
$SPARK<sub>HOME</sub>/sbin/start-all.sh
</p>


<p>
WebUI
<a href="http://master:8080/">http://master:8080/</a>
</p>

<p>
spark-shell.sh 运行后可以访问后台执行的任务
<a href="http://master:4040/">http://master:4040/</a>
</p>

<p>
spark-submit yarn 管理方式
<a href="http://master:8088/">http://master:8088/</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="https://www.manue1.site/css/jquery-2.1.3.min.js"></script>
<script src="https://www.manue1.site/css/main.js"></script>
<!-- <script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
     <script src="http://www.langdebuqing.com/css/main.js"></script> -->
</div>
</body>
</html>